{"0": {"text": "oloradoron: Is it really an insult to have relics of the past? Should Egypt tear down the pyramids because they were built with slave labor? History is replete with almost every culture and nation having slaves when they were the victors, or the strongest. Slavery is not unique to Africans, nor unique to the United States. For centuries Muslim countries on the Mediterranean Sea dealt in huge slave trades. Many of those slaves were white. Conquered nations routinely were turned into slaves. It is a very ugly and shameful history of most of humanity. Ugly or not it shouldn’t be swept under the carpet and forgotten. That is how history repeats itself. I understand why Confederate statues can be construed as offensive. They represent a sordid and brutal past that no American today should think well of. There should be no honoring of the institution of slavery, ever. The Civil War was not just about slavery. It was about a country being torn apart by a divisive and growing cancer of malcontent. It was about saving the better angels of our nation’s great founding principles. It was about preserving our future and not letting it dissipate into a mere shell of its potential. 600,000 soldiers died in that war. And who knows how many civilians? Do Black Americans have to be offended, or do they choose to be offended? If we widen our perspective and see the Civil War in its full magnitude we may realize it needs to be remembered.", "target": "other"}, "1": {"text": "igrigshowandshine-deactivated2: I have often wondered about why Whites are racists, and no other race is…… Someone finally said it. How many are actually paying attention to this? There are African Americans, Mexican Americans, Asian Americans, Arab Americans, etc. And then there are just Americans.. You pass me on the street and sneer in my direction. You call me ‘White boy,’ 'Cracker,’ 'Honkey,’ 'Whitey,’ 'Caveman’… And that’s OK.. You say that whites commit a lot of violence against you…. So why are the ghettos the most dangerous places to live? You have the United Negro College Fund. You have Martin Luther King Day. You have Black History Month. You have Cesar Chavez Day. You have Yom Hashoah. You have Ma'uled Al-Nabi. You have the NAACP. You have BET…. If we had WET (White Entertainment Television), we’d be racists. If we had a White Pride Day, you would call us racists. If we had White History Month, we’d be racists. If we had any organization for only whites to 'advance’ OUR lives, we’d be racists. We have a Hispanic Chamber of Commerce, a Black Chamber of Commerce, and then we just have the plain Chamber of Commerce. Wonder who pays for that?? A white woman could not be in the Miss Black American pageant, but any color can be in the Miss America pageant. If we had a college fund that only gave white students scholarships… You know we’d be racists. There are over 60 openly proclaimed Black Colleges in the US . Yet if there were 'White colleges’, that would be a racist college. In the Million Man March, you believed that you were marching for your race and rights. If we marched for our race and rights, you would call us racists. You are proud to be black, brown, yellow and orange, and you’re not afraid to announce it. But when we announce our white pride, you call us racists. You rob us, car jack us, and shoot at us. But, when a white police officer shoots a black gang member or beats up a black drug dealer running from the law and posing a threat to society, you call him a racist. I am proud…… But you call me a racist. Why is it that only whites can be racists?? There is nothing improper about this e-mail. Let’s see which of you are proud enough to send it on. I sadly don’t think many will. That’s why we have LOST most of OUR RIGHTS in this country. We won’t stand up for ourselves! BE PROUD TO BE WHITE! It’s not a crime YET…. But getting very close! Had to share!Anybody that knows me knows I am not racist.I love everyone who will let me.", "target": "POC"}, "2": {"text": "llegal immigrants plan to leave over Ariz. law http://bit.ly/aKcNG0", "target": "MIGRANTS"}, "3": {"text": "ttp://www.conservativenewsandhumor.com/2015/11/17/iraqi-born-humorist-tears-apart-liberals-who-refuse-to-connect-terrorism-to-islam/ Iraqi-Born Humorist Tears Apart Liberals Who Refuse To Connect Terrorism To Islam This is great. Following the Paris terror attacks, liberals have been going out their way to make it clear that the only religion they’ll attack in a stereotypical, bigoted fashion is Christianity. They’ve bent over backwards to make sure that everybody knows that not all Muslims…", "target": "MUSLIMS"}, "4": {"text": "ttp://www.conservativenewsandhumor.com/2015/11/17/woman-organizes-boycott-against-sex-with-black-men-until-inner-city-crime-drops/ Woman Organizes Boycott Against Sex With Black Men Until Inner City Crime Drops Black lust matters. A woman on the South Side of Chicago is circulating a petition calling on the women-folk to abstain from doing the Big Nasty with black dudes until they “create a strategy to keep the peace in our neighborhoods.” This just in: Black men in South Chicago have…", "target": "POC"}, "5": {"text": "amilton-for-president: poorrichardsnews: A woman who’s against the Violence Against Women act? How can this be? But it’s true, and Julie Burowski lays out her case about as well as I’ve heard anybody do so. Here’s the video: “Way to set women back, radical feminists!” I love it! Another good good video", "target": "WOMEN"}, "6": {"text": "prinkledsalt: idk who needs to hear this but women being smart and gaining power in society is good, actually, and anyone who disagrees what that statement is probably the same type of misogynist who is mighty pleased with young women thinking that calling themselves dumb bimbos who can’t do math is somehow empowering", "target": "None"}, "7": {"text": "isassigning Blame for Immigration Crisis: A TV ad falsely claims Tennessee Sen. Lamar Alexander is “responsible” for a surge of “illegal aliens” who are “overrunning our border” because he voted for “amnesty.” The surge in illegal border crossings is the result of poverty and violence in parts of Central America and has been fueled by false rumors being spread in Guatemala, El Salvador and Honduras that the U.S. is issuing “permits” to those who wish to live in the U.S. The immigration overhaul Alexander supported last year did not become law and did not change immigration policy.", "target": "None"}, "8": {"text": "laybleist: Disabled people not having marriage equity is eugenics as policy", "target": "None"}, "9": {"text": "ental-muse: I’m disappointed with how western feminists refuse to support women that have left the Abrahamic religions. Judaism, Christianity, and Islam are all misogynistic and seek to control women. However, these western feminists refuse to analyze the topic of religion. You would think feminists would be against patriarchal religious institutions that have held them back for generations. It’s painfully ironic. Yes, very painful.", "target": "None"}, "10": {"text": "etzyisrael: 80 years ago, on June 1, 1941, celebrating the Shavuot holiday, a group of Jews in Baghdad were ambushed by an armed Arab mob. The attacks and rioting went on for two days. While the exact figure is not known, it is estimated that at least 180 Jews were killed in Baghdad and Basra, perhaps as many as 600, and hundreds more were wounded. Jewish women were gang raped and mutilated. Jewish shops and homes were looted and then torched. Synagogues were looted and Torah scrolls burned. Afraid to give the dead a proper burial, the corpses were buried in a large mass grave. This pogrom was named the Farhud, which in Arabic means violent dispossession. The Farhud marked an irrevocable loss for Jewish life in Iraq and paved the way for the dissolution of the 2,600-year-old Jewish community 10 years later. Forced out by fear of a second Farhud and denationalizing legislation that made them stateless refugees, the overwhelming majority of Iraq’s Jewish community immigrated to Israel after 1948. Others held on for a few more decades, but today, the historic Jewish community of Iraq, which gave us Ezra the Scribe, the academies of Sura and Pumbedita, and the Babylonian Talmud, is no more. Unfortunately, this important moment in Jewish history is little known. It is crucial that Jews and non-Jews around the world commemorate the Farhud as an event which ended thousands of years of Jewish culture, civilization and learning. Light a virtual candle tomorrow and remember the Farhud. Glasgow Friends of Israel", "target": "None"}, "11": {"text": "ygodstillam: carnival-phantasm: flightlessboy: autumndiesirae: irrevocably-illogical: myothertardisisonthemun: straightboyfriend: telling ppl attracted to men that there are no good men out there or that men can’t love only normalizes poor treatment from men & doesn’t do anything helpful #the idea that all men are naturally garbage is super unhelpful#because it absolves awful men of the responsibility to be better #it also discourages men who do want to improve their behaviour but don’t know how #by convincing them that they’ll be reviled no matter what they do #learning how to change involves leaving confort zones #and making yourself vulnerable by approaching other people’s spaces for advice Also also it perpetuates internalized hatred and low self-esteem in men who are genuinely good and it leads to poor mental health and the sense that as a result of being the gender they are they are automatically to be reviled. It can also make trans men feel bad or guilty about being men. Favorite part of this post is that when you reblog it you also get funny brainworm asks as freebies Men are not inherently or intrinsically bad or violent. There are plenty of good men. Bad man are making the choice to be that way. Now, does the patriarchy often encourage or enable bad/violent behavior? Absolutely. But that doesn’t make men inherently bad and violent, it makes PATRIARCHY inherently bad and violent, and everyone would be better off without it, men included.", "target": "None"}, "12": {"text": "laude Taylor (@TrueFactsStated) Tweeted: Mitch is pissed! https://t.co/g2orQKVoYx https://t.co/rqmf6oc8sb https://t.co/NQcOYQmSe7 https://twitter.com/TrueFactsStated/status/1155974728206569472?s=17 #RESISTANCE #REDALERT #DUMPTRUMP #EMERGENCY #BREAKINGNEWS #TRUMPRUSSIA #MOSCOWMITCH", "target": "None"}, "13": {"text": "democrat: Susan B. Anthony was born 200 years ago in a country where few women or people of color dared to give political speeches on public platforms and that had no national voting rights for women. Both straight and queer women were often pressured into marriage when it was against their wishes. Women who did manage to remain single – or who formed partnerships with other women – were typically pitied or scorned. She worked tirelessly for most of her long life to demand racial and gender equality and her lesbian attractions only fueled her struggle against the patriarchal system she abhorred. Related: How lesbianism was turned into a problem a century ago Anthony was the mastermind – more than a hundred years before ACT UP – of a protest that had women storming polling places during the 1872 presidential election to insist they be allowed to vote. After the Civil War, African-American men had been granted the national right to vote to the exclusion of women. Anthony never married or had a serious relationship with a man. As a teenager, she prophetically confessed to her diary, in 1838, “I think any female would rather live and die an old maid.” She continued to make pronouncements that coyly hinted at her lesbian orientation. In an 1896 interview, she told the reporter, “I was very well as I was…I’m sure no man could have made me any happier than I have been.” When pressed by journalists, throughout her long life in the media spotlight, she stagecrafted a role for herself of not being able to find the right man. But the real reason she remained “single” was that her amorous desires and emotional needs were only fulfilled by women. The youthful lesbian orator Anna Dickinson, hailed as “America’s Joan of Arc” during the Civil War for rallying the war-weary Union forces to victory with her fiery speeches, became the target of Anthony’s affections in the 1860s. Dickinson was catapulted to national fame as the first woman to give a full-length political speech before Congress and her motto, which appeared on some of her publicity photos, was “The World belongs to those who take it.” Dickinson’s trailblazing achievements, acerbic wit, youthful queer energy and “handsome beauty” enraptured Anthony. Dickinson saved personal letters from Anthony that candidly indicate physical desire. Anthony flirtatiously describes her longing to spend time with the “naughty tease” Anna. ”I invite you to come to me here and sleep with me in my fourth story bed room at Mrs. Stanton’s ever so many nights,” she wrote.” To snuggle you darling closer than ever.” Anthony’s feelings of sensual anticipation reveal a woman who is very much flesh and blood. “Dear Dicky Darling…I have plain quarters…double bed – and big enough & good enough to take you in. I do so long for the scolding & pinched ears & every thing I know awaits me.” The relationship cooled off by the early 1870s. Dickinson would go on to have a series of girlfriends over the years and finally settled into a 30+ year relationship with a married woman, Sallie Ackley. The rather bemused Mr. Ackley didn’t seem to mind the living arrangement. But Anthony retained a maternal or sisterly affection for the younger Dickinson and kept mentioning her in interviews, as the decades passed. Anthony even volunteered to help solicit funds for Dickinson when she fell on hard times. In a touching 1895 letter, Anthony wrote, “My Darling Anna…I’m awfully glad to know you still live…[no one] ever has or ever will fill the niche in my heart that you did–my dear.” The theme of wistful reminiscence characterizes another striking comment Susan B. Anthony made later in life when discussing her lesbian niece, Lucy Anthony. Lucy’s life-partner was the brilliant orator and activist Rev. Anna Howard Shaw, who eventually took over the presidency of the suffrage movement and expanded public support for it. But Anthony retained a maternal or sisterly affection for the younger Dickinson and kept mentioning her in interviews, as the decades passed. Anthony even volunteered to help solicit funds for Dickinson when she fell on hard times. In a touching 1895 letter, Anthony wrote, “My Darling Anna…I’m awfully glad to know you still live…[no one] ever has or ever will fill the niche in my heart that you did–my dear.” The theme of wistful reminiscence characterizes another striking comment Susan B. Anthony made later in life when discussing her lesbian niece, Lucy Anthony. Lucy’s life-partner was the brilliant orator and activist Rev. Anna Howard Shaw, who eventually took over the presidency of the suffrage movement and expanded public support for it. Susan wrote, ”I wanted what I feared I shouldn’t find, that is a young woman who would be to me–every way–what she [Lucy] is to the Rev. Anna Shaw.” Clearly, Susan B. Anthony was happy for her queer-blended extended family. It was “niece-in-law” Shaw who was Susan Anthony’s appointed spiritual heir, in one of the most moving and significant deathbed vigils of American “herstory.” Anthony drifted in and out of consciousness as the end drew near. Shaw tried her best to comfort the dying activist with a solemn promise to do everything in her power to get the vote. The scene was an emotional “last-rites” passing of the suffrage leadership torch, from one lesbian to another. Anthony’s only regret was that she hadn’t been able to sustain an enduring lesbian union like that of Lucy Anthony and Shaw. The two life-partners created homes together and lived together and were devoted to one another till Shaw’s death in 1919, as the country stood on the cusp of national woman suffrage. Anna Shaw kept her promise. Anthony did develop a passionate queer relationship, however, in her last years with Emily Gross, a married woman who lived in Chicago. They visited each other and traveled together. Anthony referred to Gross as her “lover.” Why have most historians straightwashed Anthony? Why has popular culture not fully acknowledged the de facto queer-straight alliance of women who worked in “open secrecy” in the gender revolution that was the suffrage movement? Many generally acknowledge the toxic dishonesty of white supremacy and male supremacy in historical writing. But straight supremacy, especially the erasure of queer human beings in pre-World War II historical commentary, is still prevalent. My husband and I visited Anthony’s house in Rochester, New York, last summer. I vigorously protested the dreary straightwashed tour of her life being presented, but was made to feel like a troublemaking queer in Anthony’s own home for challenging the guide and asking questions. “What difference does that make?!,” the tour guide snapped as she told me that the feminist icon was straight. I persevered and attempted to talk to the staff members who were there, all of whom seemed resistant and condescending. We left disheartened and triggered to recall sad memories of our own “closeted” educations. I later had a long phone conversation with the president of the museum. She reached out to me after the unfortunate incident and seemed sympathetic. She patiently listened and said she wanted to hear everything I had to say, restoring my hope that the museum might evolve to forthrightly embrace the many queer figures of Anthony’s coterie. It’s troubling that our cultural institutions don’t do enough to take the initiative without being prodded to educate their staff to present queer history willingly and to respond without bigotry to questions about it. The “straight-supremacist flinch” is a homophobic kneejerk reaction that needs to be discarded. Where are the scholars and documentarians who will tell the truth and convey it compellingly to a mass audience? Why do some modern academics continue to render lesbians invisible and refuse to use the word lesbian to describe women of earlier eras, not realizing how absurd these ivory-tower practices are? If lesbians and gays are defined as predominantly romantically attracted to their own sex, then they’ve existed in various cultural settings throughout history and Anthony was obviously a lesbian. If I had learned the truth about the many magnificent contributions of queer folks like Anthony, Dickinson and Shaw, to US history – if I had known that LGBTQ history is an integral part of global history – my childhood would have been different. If we collectively continue to erase Anthony’s queerness and only vaguely say things like “she never married a man,” then what we’ll continue to churn out is the same old dishonest straight-supremacist crap. History – what people did and how they’re remembered – is power. And LGBTQ people have had the power of history taken from them for far too long. Celebrate Susan B. Anthony as the queer, multi-dimensional, intersectional equality goddess she was. She worked with other progressives to sow and fertilize the seeds of a national and global gender revolution. She wanted queer and straight women to have the unfettered liberty to develop their own genuine ways of being and to make their own choices.I", "target": "WOMEN"}, "14": {"text": " B. Anthony was born 200 years ago in a country where few women or people of color dared to give political speeches on public platforms and that had no national voting rights for women. Both straight and queer women were often pressured into marriage when it was against their wishes. Women who did manage to remain single – or who formed partnerships with other women – were typically pitied or scorned. She worked tirelessly for most of her long life to demand racial and gender equality and her lesbian attractions only fueled her struggle against the patriarchal system she abhorred. Related: How lesbianism was turned into a problem a century ago Anthony was the mastermind – more than a hundred years before ACT UP – of a protest that had women storming polling places during the 1872 presidential election to insist they be allowed to vote. After the Civil War, African-American men had been granted the national right to vote to the exclusion of women. Anthony never married or had a serious relationship with a man. As a teenager, she prophetically confessed to her diary, in 1838, “I think any female would rather live and die an old maid.” She continued to make pronouncements that coyly hinted at her lesbian orientation. In an 1896 interview, she told the reporter, “I was very well as I was…I’m sure no man could have made me any happier than I have been.” When pressed by journalists, throughout her long life in the media spotlight, she stagecrafted a role for herself of not being able to find the right man. But the real reason she remained “single” was that her amorous desires and emotional needs were only fulfilled by women. The youthful lesbian orator Anna Dickinson, hailed as “America’s Joan of Arc” during the Civil War for rallying the war-weary Union forces to victory with her fiery speeches, became the target of Anthony’s affections in the 1860s. Dickinson was catapulted to national fame as the first woman to give a full-length political speech before Congress and her motto, which appeared on some of her publicity photos, was “The World belongs to those who take it.” Dickinson’s trailblazing achievements, acerbic wit, youthful queer energy and “handsome beauty” enraptured Anthony. Dickinson saved personal letters from Anthony that candidly indicate physical desire. Anthony flirtatiously describes her longing to spend time with the “naughty tease” Anna. ”I invite you to come to me here and sleep with me in my fourth story bed room at Mrs. Stanton’s ever so many nights,” she wrote.” To snuggle you darling closer than ever.” Anthony’s feelings of sensual anticipation reveal a woman who is very much flesh and blood. “Dear Dicky Darling…I have plain quarters…double bed – and big enough & good enough to take you in. I do so long for the scolding & pinched ears & every thing I know awaits me.” The relationship cooled off by the early 1870s. Dickinson would go on to have a series of girlfriends over the years and finally settled into a 30+ year relationship with a married woman, Sallie Ackley. The rather bemused Mr. Ackley didn’t seem to mind the living arrangement. But Anthony retained a maternal or sisterly affection for the younger Dickinson and kept mentioning her in interviews, as the decades passed. Anthony even volunteered to help solicit funds for Dickinson when she fell on hard times. In a touching 1895 letter, Anthony wrote, “My Darling Anna…I’m awfully glad to know you still live…[no one] ever has or ever will fill the niche in my heart that you did–my dear.” The theme of wistful reminiscence characterizes another striking comment Susan B. Anthony made later in life when discussing her lesbian niece, Lucy Anthony. Lucy’s life-partner was the brilliant orator and activist Rev. Anna Howard Shaw, who eventually took over the presidency of the suffrage movement and expanded public support for it. But Anthony retained a maternal or sisterly affection for the younger Dickinson and kept mentioning her in interviews, as the decades passed. Anthony even volunteered to help solicit funds for Dickinson when she fell on hard times. In a touching 1895 letter, Anthony wrote, “My Darling Anna…I’m awfully glad to know you still live…[no one] ever has or ever will fill the niche in my heart that you did–my dear.” The theme of wistful reminiscence characterizes another striking comment Susan B. Anthony made later in life when discussing her lesbian niece, Lucy Anthony. Lucy’s life-partner was the brilliant orator and activist Rev. Anna Howard Shaw, who eventually took over the presidency of the suffrage movement and expanded public support for it. Susan wrote, ”I wanted what I feared I shouldn’t find, that is a young woman who would be to me–every way–what she [Lucy] is to the Rev. Anna Shaw.” Clearly, Susan B. Anthony was happy for her queer-blended extended family. It was “niece-in-law” Shaw who was Susan Anthony’s appointed spiritual heir, in one of the most moving and significant deathbed vigils of American “herstory.” Anthony drifted in and out of consciousness as the end drew near. Shaw tried her best to comfort the dying activist with a solemn promise to do everything in her power to get the vote. The scene was an emotional “last-rites” passing of the suffrage leadership torch, from one lesbian to another. Anthony’s only regret was that she hadn’t been able to sustain an enduring lesbian union like that of Lucy Anthony and Shaw. The two life-partners created homes together and lived together and were devoted to one another till Shaw’s death in 1919, as the country stood on the cusp of national woman suffrage. Anna Shaw kept her promise. Anthony did develop a passionate queer relationship, however, in her last years with Emily Gross, a married woman who lived in Chicago. They visited each other and traveled together. Anthony referred to Gross as her “lover.” Why have most historians straightwashed Anthony? Why has popular culture not fully acknowledged the de facto queer-straight alliance of women who worked in “open secrecy” in the gender revolution that was the suffrage movement? Many generally acknowledge the toxic dishonesty of white supremacy and male supremacy in historical writing. But straight supremacy, especially the erasure of queer human beings in pre-World War II historical commentary, is still prevalent. My husband and I visited Anthony’s house in Rochester, New York, last summer. I vigorously protested the dreary straightwashed tour of her life being presented, but was made to feel like a troublemaking queer in Anthony’s own home for challenging the guide and asking questions. “What difference does that make?!,” the tour guide snapped as she told me that the feminist icon was straight. I persevered and attempted to talk to the staff members who were there, all of whom seemed resistant and condescending. We left disheartened and triggered to recall sad memories of our own “closeted” educations. I later had a long phone conversation with the president of the museum. She reached out to me after the unfortunate incident and seemed sympathetic. She patiently listened and said she wanted to hear everything I had to say, restoring my hope that the museum might evolve to forthrightly embrace the many queer figures of Anthony’s coterie. It’s troubling that our cultural institutions don’t do enough to take the initiative without being prodded to educate their staff to present queer history willingly and to respond without bigotry to questions about it. The “straight-supremacist flinch” is a homophobic kneejerk reaction that needs to be discarded. Where are the scholars and documentarians who will tell the truth and convey it compellingly to a mass audience? Why do some modern academics continue to render lesbians invisible and refuse to use the word lesbian to describe women of earlier eras, not realizing how absurd these ivory-tower practices are? If lesbians and gays are defined as predominantly romantically attracted to their own sex, then they’ve existed in various cultural settings throughout history and Anthony was obviously a lesbian. If I had learned the truth about the many magnificent contributions of queer folks like Anthony, Dickinson and Shaw, to US history – if I had known that LGBTQ history is an integral part of global history – my childhood would have been different. If we collectively continue to erase Anthony’s queerness and only vaguely say things like “she never married a man,” then what we’ll continue to churn out is the same old dishonest straight-supremacist crap. History – what people did and how they’re remembered – is power. And LGBTQ people have had the power of history taken from them for far too long. Celebrate Susan B. Anthony as the queer, multi-dimensional, intersectional equality goddess she was. She worked with other progressives to sow and fertilize the seeds of a national and global gender revolution. She wanted queer and straight women to have the unfettered liberty to develop their own genuine ways of being and to make their own choices.I", "target": "None"}, "15": {"text": "urvy-models: wilwheaton: 53 men and women, sworn to protect and defend America and her ideals, failed to do that, today. 53 men and women did what no army or government has been able to do for over 250 years. They took the fundamental principle that America is built upon, that no person is above the law, and they destroyed it. They destroyed it in service of the most corrupt and plainly criminal person to ever hold the office of president. Over the coming weeks and months, more evidence of Trump’s lawbreaking and criminality will continue to pile up, and the full extent of their cover-up will be known. They know this, and they don’t care. May these men and women be remembered by history for the partisan cowards they are. When America and all of her people needed them the most, they failed, and they failed in service of a criminal, who is now emboldened to become the autocrat he has always dreamed of becoming. They know this, and they don’t care. America as I have known it for my entire life was killed today, stabbed in the back 53 times, betrayed by the very people who were entrusted with defending her. May those people never have a single moment of peace for the rest of their lives. May they be shouted at and shamed and driven from public life into the dark corners of the world, like the rats they are. Amen Sir,", "target": "None"}, "16": {"text": "artfargo: Six months ago, thousands of Christians stormed the Capitol, in an effort to overthrow the government and install their preferred choice as dictator for life. We know they were Christians for a number of reasons: • They were waving crosses and signs proclaiming their faith in Jesus • They celebrated claiming the House chamber with a prayer • At least one of their number was a pastor A lot has happened in the past six months, but let’s look back on the things that didn’t happen: • Nobody has suggested that this was planned more than two and a half months in advance, even though Christians have had their own flag and Pledge of Allegiance for more than a century • Nobody has asked random Christians why they didn’t report the threat if they didn’t want it to succeed • No Christian politician has been asked by an interviewer to show proof that they aren’t in league with our enemies • No restaurant has put up a sign declaring that Christians are unwelcome inside • No politician has called for war against a Christian-majority country • No country singer has released a song asking why we shouldn’t be at war with whichever Christian-majority country politicians want to bomb • No politician from either party has said that prohibiting immigration from Christian-majority countries is a matter of national security You might think that some of those would be done - maybe even that a few of them sound like good ideas - but None of them have been implemented. Huh. Makes you wonder why we did them all with brown-skinned Muslims, doesn’t it?", "target": "other"}, "17": {"text": "nigmasandepiphanies: women in stem this, women in stem that okay but how about women in arms of other women", "target": "None"}, "18": {"text": "seless-catalanfacts: Women working in a licorice pre-industrial factory. Late 19th century, Mequinensa. Source: Centre d’Estudis Jesús Moncada / Museus de Mequinensa. Workers in a paper mill, 1920s. In paper mills from the 1700s to early 1900s, most workers were women. There were also men, who did the more refined work, which paid more. Women did the more physical labour, since they were considered less intellectual, and were paid less. Source: Museu Molí Paperer de Capellades. People of all genders working alike as capers (making cork stoppers), 1910s-1920s, unknown location in Catalonia. Source: Collection Roisin/IEFC. Sewing room in a shack in Poble Sec (Barcelona), 1913. In the 19th and 20th centuries, the textile industry has been a motor of Catalonia’s economy, and one where most workers were women. Lots of women worked in factories or making the clothes at home. In this photo, you can see how a group of women, maybe a family, worked from their home. Do not think this was a commodity or a luxury: this means that the small living space serves also as an uncomfortable working space, where they have to be taking care of the children, washing and cooking meals, among other domestic tasks, at the same time as performing their job, without lowering their productivity. Source: Museu d’Història de Catalunya. Women doing the laundry in a wash basin. 1910s, Premià de Dalt. Source: Collection Roisin/IEFC. Women doing the laundry in the stream. 1930s, Tossa de Mar. Laundry is one of the many works of domestic labour, an unpaid job done both by women who have other jobs (the vast majority of women throughout history) and by housewives. A job which many people still consider to be “not working”. Source: Collection Roisin/IEFC. People working in a Uralite (cement+asbestos) factory. 1923-1931, Cerdanyola del Vallès. This factory produced little sculptures, usually copies of Ancient or Renaissance artworks. The factory was owned by the Italian family Lena, and so the pieces that it produced were signed as Alberto Lena and Óscar Lena. However, these two men didn’t work to make them. The workers were mostly women from Cerdanyola and Ripollet, as it continued to be the case until the 1960s. The paste they used was made of cement and asbestos, and so most of its workers became sick for the rest of their lives as a result of the many hours they spent every day in contact with the material. Source: Museu d’Art de Cerdanyola. File cards of workers in a textile factory. 1940s, Vilassar de Dalt. A hard work in a factory where they were by law paid less only because of their gender. Source: Museu de Vilassar de Dalt. Working in the vineyards. 1940s, Cambrils. Source: Fons de la família Vidal-Barraquer / Revista Cambrils.cat. Women cutting lettuce, preparing it to be exported or sold. 1950-60, el Prat de Llobregat. To be able to transport the products fresh, the vegetables were taken to the warehouses at night. The workers who prepared them were mostly women, who worked all night, including in winter in low temperatures, with no sort of heating. Source: Museu del Prat de Llobregat. And then some say that women have never worked outside of home. It is true that many women have been forced to stay at home, doing domestic labour, in a move that deprived them of financial independence and so made them depend on their husbands. However, most women have been doing that domestic and care labour on top of work outside of the home. Don’t let anyone tell you that women have never done anything or that women belong to the domestic sphere. Not in the name of “tradition”, and certainly not in the name of history.", "target": "None"}, "19": {"text": "o dejes que los hombres que odian a las mujeres ,definan “el feminismo ” como mujeres que odian a los hombres Don’t let them men who hate to women, define “feminism” as women who hate to the men", "target": "None"}, "20": {"text": "hejabaritribe: black panther crossed the $1 billion mark", "target": "None"}, "21": {"text": "ycashghostcop: sportsbianism: btw, the reason women’s sports in the US are what they are is title ix, which legally requires colleges to offer the same number of athletic scholarships to male and female students. the ratio of scholarships for the past few decades has been 1:1. one female for every one male trans men (females) are not taking scholarship slots on men’s teams. trans women (males) are now beginning to take slots on women’s teams. this skews the ratio. the more slots they take, the more the ratio will skew. males gain athletic and scholarship opportunities, females lose. and we’re talking about college, guys. in a country where a college education without a scholarship costs hundreds of thousands of dollars. it’s such a no brainer dumb dumb example of blatant unfairness…. crack kills TRUTH!!! DON’T DOUBT THE TRUTH!!!", "target": "LGBT+"}, "22": {"text": "irlactionfigure: In Israel, we are familiar with the story. A couple of armed terrorists walk into a building and start shooting Jews. A pigua (terrorist attack). Americans are also beginning to become familiar with it as well, after piguim at synagogues in Pittsburgh and California, and now a Jewish market in Jersey city. Europe, too, has long since accustomed herself to such things. In Israel we also have street attacks on Jews, sometimes with knives and sometimes with cars. In America the street attacks have mostly been with fists or bricks or bats, but unless something changes, the knives will come out soon, if they haven’t already. Hardened as they may be to anti-Jewish violence, Israelis were shocked by Jersey City. Not so much by the attack, which was small by our standards with “only” three civilians and one police officer murdered, but by the response of the local community, captured in a video (here) which appears to show (I have reservations, discussed below) local residents blaming the Jews themselves for the attack, and expressing vicious hatred of them. There are various factors contributing to the wave of violent Jew-hatred that has suddenly burst upon the world. It’s not simple. There are several foci of infection that have festered independently as well as cross-fertilizing themselves, gaining new ideas, strategies, connections – and adherents. There is the leftist/Arab Israel-focused thread which flourishes at the UN and in Europe, which grew from a seed planted by the KGB in the 1960s; there is the neo-Nazi thread which truly goes back to the original Nazis; there is the paleo-Catholic Christ-killer theme that Pope Paul VI’s nostre aetate never succeeded to stamp out; there is the Quran-based Islamic version; there is the Christian Identity movement in the US; there is the Nation of Islam’s ideology, beginning with Elijah Muhammad and espoused today by Louis Farrakhan; and there are countless small groups with various forms of antisemitic thinking, including the Black Hebrew Israelites with which the Jersey City killers were associated. And those are just off the top of my head. Seventy years or so after the Holocaust, the pressure from all of these antisemitic memes – especially those connected with the Israel-Arab conflict – broke through the taboo against public expression of antisemitism. It became possible to say openly that Jews were every bit as bad as Hitler thought they were, and that the best thing would be for them to disappear. At the same time, the example provided by the Palestinians, who showed that if you really hate Jews, you can murder them, made killing Jews a thinkable option for today’s antisemites. Mix in a little social media to serve as a catalyst and medium for coordination, and here we are today. So what can be done, say, in Jersey City? First, I’m not sure that the video is an accurate depiction of the mood of most of the non-Jewish community. There are some accounts (also here) that say that the Hasidic community got along well with the local, mostly black, residents, despite tensions about gentrification of the neighborhood. I don’t entirely trust the video: it appears to be edited heavily, and None of the speakers responsible for the anti-Jewish remarks were visible. But still, I heard what I heard. Let’s assume that at least some local residents share the feelings expressed in the video. Should we try to educate them, to explain to them that their attitudes are wrong – that the Satmar Hasidim who live in their neighborhood are people just like them, and don’t deserve to be shot? That would be hard to do. They are not just like them, they dress differently, eat differently, speak a different language, educate their children differently, and of course practice a different and perhaps sinister religion. They stay aloof from the locals, which is often interpreted as “they think they are better than we are” (I am not speculating on whether this is a correct interpretation). The secret to educating antisemites so that they will stop being antisemites remains undiscovered. What exactly do you say to someone to make them stop hating Jews? Teaching them about the Holocaust just gives them ideas. It is also not possible to make the Hasidic Jews more appealing to non-Jews. Should we tell them to dress differently? To eat the same food? To send their children to public schools? To convert to Christianity or Islam? All this was tried before, with very unhappy results. Trying to change Jews in order to reduce antisemitism is a losing proposition; antisemites will always find a reason to hate them. This was true for Spanish Conversos in the 15th and 16th centuries, for Germans of the Mosaic Persuasion in the 19th, and probably will someday be true for the progressive Reform Jews of North America. The problem resides with the antisemites, not the Jews, and it can’t be fixed by “fixing” the Jews. But even if we can’t eliminate antisemitism, there are things we can do to mitigate the current wave of antisemitic acts. One is to understand and act on the principle that although we can’t guarantee that people will like Jews, we can force them to respect us, both as individual Jews in the diaspora and collectively in the State of Israel. In the diaspora, Jews should secure their institutions and arm themselves to the extent that the law permits. Self-defense training should be part of all Jewish education. Nobody is respected for being a victim. The primary function of a state is to guarantee the security of its citizens. Insofar as we must depend on government, particularly when restrictive laws make self-defense difficult, then we have to demand that it does its job. When there is a crime wave targeting a specific sector of the population, police resources in that sector have to be increased. Jews ought to have enough political power in a place like New York City to insist that street violence against their fellow Jews, even if the perpetrators are black and Hispanic De Blasio voters, be suppressed. Unfortunately, this is not the case in Hudson County, New Jersey, where Jersey City is located. Finally, if it turns out that diaspora Jewish communities cannot be defended or that their host governments do not care to do their part in doing so, there is the option of aliyah. This puts the Satmar Hasidim, who bitterly oppose the Jewish state, between a rock and a hard place. But that is their problem, not mine. Abu Yehuda", "target": "None"}, "23": {"text": "outhernsideofme: wrecklessnothing: Studies show that: More women are valedictorians than men. More women go to college than men. More women graduate than men. Women make better grades than men. But we’re still seen as inferior.", "target": "None"}, "24": {"text": " John 1:9 If we confess our sins, he is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness.", "target": "None"}, "25": {"text": "egal permanent residents can get social security numbers. Otherwise they are only here on work visas, student visas or the like and are NOT immigrants. The ones with “tax IDs” are not authorized to work in USA and they could be getting benefits although they pay no income tax. AOC is full of beans when she says tax paying immigrants won’t get a relief check.", "target": "None"}, "26": {"text": "eftists are pointing the slavery finger at those they oppose politically. They spread the rhetoric as if white Americans of the past were solely responsible for slavery and only black people were enslaved. African’s enslaved their own people. The Muslim slave trade of Africans was much greater in numbers than slavery in the USA. More whites were enslaved in North Africa than blacks were in the 13 colonies or the U.S.A. Although slavery was common worldwide for thousands of years and all races were enslaved, leftists ignore that it was white Americans who abolished slavery.They ignore the fact that white people were being enslaved within the Ottoman Empire decades after slavery was abolished in the USA.", "target": "POC"}, "27": {"text": "obert-the-foul-blog: cyan-opinions: cyan-opinions: This is a link to Florida House Bill 1557. I have read it. The PDF is 7 pages. The text of the bill is 4 pages. You can read it in five minutes. I am too goddamn tired of people being pissy that the bill says this and the bill says that and no the fuck it doesn’t. If you think the bill: Forbids teachers from mentioning their same sex spouse Forbids students from mentioning a gay family member Forbids teaching about LGBT figures or events Forbids LGBT people from teaching or teachers from supporting LGBT students Applies only to gay people or gay sexuality Is intended to prevent children from becoming aware that LGBT people exist Then you have not read it and should shut up until you have. And if you think the bill forbids teaching students how to avoid and report sexual misconduct by adults, you not only haven’t read it, but are unaware that the state of Florida explicitly requires this topic be taught. And, if you don’t feel like clicking on a bloody link, here’s the text after the break: Keep reading", "target": "None"}, "28": {"text": "noantisemitism: On Indigenous Peoples Day, this is a friendly reminder that Jews are indigenous to Israel. That Jewish traditions, the historical records, the archology, genetic studies all support this. That Hebrew is the last Canaanite language spoken in the world today, meaning that the Jews speaking it today in Israel are the last speakers of the land’s indigenous language. That erasing Jewish history and the very forming of Jewish identity, language, religion, values and customs in the Jewish ancestral homeland is a distortion of historical fact and a denial of indigenous rights. That Jews do fit the UN criteria for indigenous people in Israel. That those who started the narrative that erases Jewish indigeneity in Israel, implying Jews have no place that they are indigenous to, are interested in the destruction of Israel as the one Jewish state, meaning they are supporting the dispossession of the indigenous people of this land. This following link isn’t the usual pile of proof I would normally add to support each claim, but for now it will do. Because I need to make this statement. Because it is incredibly distressing to see the indigeneity of the Jews being erased and denied on the very day that celebrates indigenous people and should include them. https://www.newsweek.com/are-jews-indigenous-people-heres-what-native-american-jew-thinks-opinion-1539233", "target": "None"}, "29": {"text": "altrat42: Nonenosome: hankstersstuff: governor–megatron: No matter how equal they want to be there will always be a double standard! It’s the same routine. Women are targeted to be forced to also sign up for Selective Service so feminists shout about how bad that is because “Nobody should have to join”. Then once women are removed, yet again, they suddenly go quiet because they didn’t actually mean “nobody”.", "target": "WOMEN"}, "30": {"text": "he-mighty-birdy: bigwordsandsharpedges: dankxsinatra: clungedestroyer: Op is deactivated", "target": "None"}, "31": {"text": "yan-opinions: All the shit people say about Florida HB 1557 that’s complete bullshit: Children can’t talk about their gay family Teachers can’t teach about LGBT historical figures or equal rights Children will never learn that a family isn’t always a mom and dad with kids Children 5-9 years old are taught heterosexuality in their lessons so they should be taught heterosexuality as well Children will be spied on by teachers to find out if they’re gay Teachers have to tell parents if their child tells them they are gay (this WAS a proposed amendment to the bill but it was withdrawn and did not pass)", "target": "None"}, "32": {"text": "o69mustangs: towerofhealthtwo: bobwall1962: therockyway: Something to ponder…………… Something to share…. 31 Reasons Why I Won’t Take the Vaccine by Rabbi Chananya Weissman. 1. It’s not a vaccine. A vaccine by definition provides immunity to a disease. This does not provide immunity to anything. In a best-case scenario, it merely reduces the chance of getting a severe case of a virus if one catches it. Hence, it is a medical treatment, not a vaccine. I do not want to take a medical treatment for an illness I do not have. 2. The drug companies, politicians, medical establishment, and media have joined forces to universally refer to this as a vaccine when it is not one, with the intention of manipulating people into feeling safer about undergoing a medical treatment. Because they are being deceitful, I do not trust them, and want nothing to do with their medical treatment. 3. The presumed benefits of this medical treatment are minimal and would not last long in any case. The establishment acknowledges this, and is already talking about additional shots and ever-increasing numbers of new “vaccines” that would be required on a regular basis. I refuse to turn myself into a chronic patient who receives injections of new pharmaceutical products on a regular basis simply to reduce my chances of getting a severe case of a virus that these injections do not even prevent. 4. I can reduce my chances of getting a severe case of a virus by strengthening my immune system naturally. In the event I catch a virus, there are vitamins and well-established drugs that have had wonderful results in warding off the illness, without the risks and unknowns of this medical treatment. 5. The establishment insists that this medical treatment is safe. They cannot possibly know this because the long-term effects are entirely unknown, and will not be known for many years. They may speculate that it is safe, but it is disingenuous for them to make such a claim that cannot possibly be known. Because they are being disingenuous, I do not trust them, and I want no part of their treatment. 6. The drug companies have zero liability if anything goes wrong, and cannot be sued. Same for the politicians who are pushing this treatment. I will not inject myself with a new, experimental medical device when the people behind it accept no liability or responsibility if something goes wrong. I will not risk my health and my life when they refuse to risk anything. 7. Israel’s Prime Minister has openly admitted that the Israeli people are the world’s laboratory for this experimental treatment. I am not interested in being a guinea pig or donating my body to science. 8. Israel agreed to share medical data of its citizens with a foreign drug company as a fundamental part of their agreement to receive this treatment. I never consented for my personal medical data to be shared with any such entity, nor was I even asked. I will not contribute to this sleazy enterprise. 9. The executives and board members at Pfizer are on record that they have not taken their own treatment, despite all the fanfare and assurances. They are claiming that they would consider it unfair to “cut the line”. This is a preposterous excuse, and it takes an unbelievable amount of chutzpah to even say such a thing. Such a “line” is a figment of their own imagination; if they hogged a couple of injections for themselves no one would cry foul. In addition, billionaires with private jets and private islands are not known for waiting in line until hundreds of millions of peasants all over the world go first to receive anything these billionaires want for themselves. 10. The establishment media have accepted this preposterous excuse without question or concern. Moreover, they laud Pfizer’s executives for their supposed self-sacrifice in not taking their own experimental treatment until we go first. Since they consider us such fools, I do not trust them, and do not want their new treatment. They can have my place in line. I’ll go to the very back of the line. 11. Three facts that must be put together: Bill Gates is touting these vaccines as essential to the survival of the human race. Bill Gates believes the world has too many people and needs to be “depopulated”. Bill Gates, perhaps the richest man in the world, has also not been injected. No rush. Uh, no. I’ll pass on any medical treatments he wants me to take. 12. The establishment has been entirely one-sided in celebrating this treatment. The politicians and media are urging people to take it as both a moral and civic duty. The benefits of the treatment are being greatly exaggerated, the risks are being ignored, and the unknowns are being brushed aside. Because they are being deceitful and manipulative, I will not gamble my personal wellbeing on their integrity. 13. There is an intense propaganda campaign for people to take this treatment. Politicians and celebrities are taking selfies of themselves getting injected (perhaps in some cases pretending to get injected), the media is hyping this as the coolest, smartest, most happy and fun thing to do. It is the most widespread marketing campaign in history. This is not at all appropriate for any medical treatment, let alone a brand new one, and it makes me recoil. 14. The masses are following in tow, posting pictures of themselves getting injected with a drug, feeding the mass peer pressure to do the same. There is something very alarming and sick about this, and I want no part of it. I never took drugs just because “everyone’s doing it” and it’s cool. I’m certainly not going to start now. 15. Those who raise concerns about this medical treatment are being bullied, slandered, mocked, censored, ostracized, threatened, and fired from their jobs. This includes medical professionals who have science-based concerns about the drug and caregivers who have witnessed people under their charge suffering horrible reactions and death shortly after being injected. When the establishment is purging good people who risk everything simply to raise concerns about a new medical treatment — even if they don’t outright oppose it — I will trust these brave people over the establishment every time. I cannot think of a single similar case in history when truth and morality turned out to be on the side of the establishment. 16. This is the greatest medical experiment in the history of the human race. 17. It is purposely not being portrayed as the greatest medical experiment in the history of the human race, and the fact that it is a medical experiment at all is being severely downplayed. 18. Were they up front with the masses, very few would agree to participate in such an experiment. Manipulating the masses to participate in a medical experiment under false pretenses violates the foundations of medical ethics and democratic law. I will not allow unethical people who engage in such conduct to inject me with anything. 19. The medical establishment is not informing people about any of this. They have become marketing agents for an experimental drug, serving huge companies and politicians who have made deals with them. This is a direct conflict with their mandate to concern themselves exclusively with the wellbeing of the people under their care. Since the medical establishment has become corrupted, and has become nothing more than a corporate and political tool, I do not trust the experimental drug they want so badly to inject me with. 20. We are being pressured in various ways to get injected, which violates medical ethics and the foundations of democratic society. The best way to get me not to do something is to pressure me to do it. 21. The government has sealed their protocol related to the virus and treatments for THIRTY YEARS. This is information that the public has a right to know, and the government has a responsibility to share. What are they covering up? Do they really expect me to believe that everything is kosher about all this, and that they are concerned first and foremost with my health? The last time they did this was with the Yemenite Children Affair. If you’re not familiar with it, look it up. Now they’re pulling the same shtick. They didn’t fool me the first time, and they’re definitely not fooling me now. 22. The government can share our personal medical data with foreign corporations, but they won’t share their own protocol on the matter with us? I’m out. 23. The establishment has recruited doctors, rabbis, the media, and the masses to harangue people who don’t want to get injected with a new drug. We are being called the worst sort of names. We are being told that we believe in crazy conspiracies, that we are against science, that we are selfish, that we are murderers, that we don’t care about the elderly, that it’s our fault that the government continues to impose draconian restrictions on the public. It’s all because we don’t want to get injected with an experimental treatment, no questions asked. We are even being told that we have a religious obligation to do this, and that we are grave sinners if we do not. They say that if we do not agree to get injected, we should be forced to stay inside our homes forever and be ostracized from public life. This is horrific, disgusting, a perversion of common sense, morality, and the Torah. It makes me recoil, and only further cements my distrust of these people and my opposition to taking their experimental drug. How dare they? 24. I know of many people who got injected, but None of them studied the science in depth, carefully weighed the potential benefits against the risks, compared this option to other alternatives, was truly informed, and decided this medical treatment was the best option for them. On the contrary, they got injected because of the hype, the propaganda, the pressure, the fear, blind trust in what “the majority of experts” supposedly believed (assuming THEY all studied everything in depth and were completely objective, which is highly dubious), blind trust in what certain influential rabbis urged them to do (ditto the above), or hysterical fear that the only option was getting injected or getting seriously ill from the virus. When I see mass hysteria and cult-like behavior surrounding a medical treatment, I will be extremely suspicious and avoid it. 25. The drug companies have a long and glorious history of causing mass carnage with wonder drugs they thrust on unsuspecting populations, even after serious problems had already become known. Instead of pressing the pause button and halting the marketing of these drugs until these issues could be properly investigated, the drug companies did everything in their power to suppress the information and keep pushing their products. When companies and people have demonstrated such gross lack of concern for human life, I will not trust them when they hype a new wonder drug. This isn’t our first rodeo. 26. Indeed, the horror stories are already coming in at warp speed, but the politicians are not the least bit concerned, the medical establishment is brushing them aside as unrelated or negligible, the media is ignoring it, the drug companies are steaming ahead at full speed, and those who raise a red flag continue to be bullied, censored, and punished. Clearly my life and my wellbeing are not their primary concern. I will not be their next guinea pig in their laboratory. I will not risk being the next “coincidence”. 27. Although many people have died shortly after getting injected — including perfectly healthy young people — we are not allowed to imply that the injection had anything to do with it. Somehow this is anti-science and will cause more people to die. I believe that denying any possible link, abusing people who speculate that there might be a link, and demonstrating not the slightest curiosity to even explore if there might be a link is what is anti-science and could very well cause more people to die. These same people believe I am obligated to get injected as well. No freaking thanks. 28. I am repulsed by the religious, cult-like worship of a pharmaceutical product, and will not participate in this ritual. 29. My “healthcare” provider keeps badgering me to get injected, yet they have provided me no information on this treatment or any possible alternatives. Everything I know I learned from others outside the establishment. Informed consent has become conformed consent. I decline. 30. I see all the lies, corruption, propaganda, manipulation, censorship, bullying, violation of medical ethics, lack of integrity in the scientific process, suppression of inconvenient adverse reactions, dismissal of legitimate concerns, hysteria, cult-like behavior, ignorance, closed-mindedness, fear, medical and political tyranny, concealment of protocols, lack of true concern for human life, lack of respect for basic human rights and freedoms, perversion of the Torah and common sense, demonization of good people, the greatest medical experiment of all time being conducted by greedy, untrustworthy, godless people, the lack of liability for those who demand I risk everything… I see all this and I have decided they can all have my place in line. I will put my trust in God. I will use the mind He blessed me with and trust my natural instincts. Which leads to the final reason which sums up why I will not get “vaccinated.” 31. The whole thing stinks. Source: gatesofvienna.net/…s-why-i-wont-take-the-vaccine/ not a chance they inject me…. THE ABBREVIATED VERSION with pictures: Totally worth the read!", "target": "other"}, "33": {"text": "ividhotsexy: zuode: zuode: zuode: women be They be p woman be pretty", "target": "None"}, "34": {"text": "lonso962: alonso962: Black and White is Magic @mommysdirtypage", "target": "None"}, "35": {"text": "ssociation-of-freed-people: The attacks on Joe Rogan which are now accusing him of racism are all cynical bullshit. The prime minister of Canada has been in blackface more times than he can remember. The democratic governor of Virginia was either wearing a klan uniform or was in blackface. It wasn’t a problem. Joe Biden called black people “Super Predators” on the floor of the senate, he told black people just last year that they were not black if they didn’t support him. All the pearl clutching these people are doing to destroy Rogan is disingenuous and should be ignored. Do not mistake it for hypocrisy. The arbitrary public accusation and condemnation of specific individuals for political crimes is a hallmark feature of authoritarian systems and ideologies.", "target": "None"}, "36": {"text": "rolifeproliberty: airelf: prolifeproliberty: antiporn-activist: prolifeproliberty: unhingedcherhorowitz: stantler: Perhaps the biggest psyop of our time is how sex positivity centers female sexual empowerment around sex acts that primarily benefit and pleasure men and no one else now to reverse this I believe women will have to start being more sexually selfish by about 120%. It’s a sacrifice I hope we’re all willing to make Actual sex positivity for women would revolve around: 1. Women speaking up when they’re not experiencing pleasure. 2. Stopping sex when it’s not feeling good. 3. Women refusing to fake pleasure for any reason. 4.The eradication of our sexuality as a performance or service. 5. Women’s sexuality becoming an authentic expression that centered on our desires and actual, physical pleasure not just the psycho-emotional pleasure that sometimes comes with being a desired object. 6. Your sex partner taking on some of burden of pregnancy prevention and not leaving it all up to you. 7. Abortion on demand. 8. Free reproductive care everywhere. 9. Free birth control. The development of birth control for women that is pain free and doesn’t have any negative side effects 10. Closing the orgasm gap. Restructuring from scratch ALL sexual scripts and habits until women are as likely to cum from sex as men. The kiss-blow job-penetration-script for hetero women being discarded. 11. Continuing to eradicate any shame or danger around sex for women. That can only be done with eradicating violence against women and misogyny in society. How can we expect women to embrace their sexual desires when their desires can still endanger them? You’re attracted to someone and you want to go home with him but he might kill you. You’re horny and want to have a good time but the fact that you wanted sex might be used against you later to justify mistreatment, devaluing, sexual assault or stop you from getting a job. They tell girls “Be a slut, do whatever you want” and forget to mention that society still has severe punishments for “sluts” that nobody is protecting you from it. What passes for sex positivity in mainstream feminism is total bullshit. They just tell you to make porn, sell pussy, indulge men’s kinks and be sexually available. They don’t really care about women. I like how y’all just slip “abortion on demand” in there like it’s on the same level with the rest of this. As if somehow women having a satisfying sex life depends on being able to kill babies. It’s sickening. Well I guess the difference is that we don’t believe a lentil bean-sized zygote is an actual baby. Do you believe the zygote is alive and human? literally no I agree that eggs and sperm are not human beings. They are gametes. They each contain a half set of human chromosomes. However, when a sperm and egg combine, the two half sets create a unique whole set of DNA distinct from either parent. This single cell is a new individual living human. That’s how biology works. So no, your period isn’t murder because an unfertilized egg isn’t a human being. It’s the same reason a vegetarian can eat an unfertilized chicken egg but not a fertilized one. One is an animal product and the other is the actual animal. Magic School Bus literally covered this in the episode “The Magic School Bus Cracks a Yolk.” I wish I could convince everyone. Don’t abort. If you live long enough you will come to regret it.", "target": "None"}, "37": {"text": "eform-by-riot: memeufacturing: honeyrabbits: remikanazi: A lot of folks outraged by Trump’s rhetoric on Muslims don’t mind Democrats bombing Muslims, spying on Muslims, or entrapping Muslims. ??? Because the people getting bombed and spied on are the ones that are considered potential threats, whereas Trump’s rhetoric targets all Muslims??? mhm yeah… because US-led terrorism is totally pruning “potential threats”.. yeah… thats what it does… sure… Fucking hell. Liberals don’t give a fuck about like actual freedom, as long as it has even the appearance of being non-discriminatory they’re totally satisfied with the worst oppression.", "target": "None"}, "38": {"text": "m-not-norm: glisteringlord: im-not-norm: does anybody have any sort of articles, studies, WHATEVER about the vaccine and its effects on pregnant women? CDC manipulated study data to show the Covid-19 Vaccines are safe for Pregnant Women when in reality 4 in 5 suffered a miscarriage https://dailyexpose.co.uk/2021/07/06/cdc-manipulated-study-data-to-show-the-covid-19-vaccines-are-safe-for-pregnant-women-when-in-reality-4-in-5-suffered-a-miscarriage/ Among 827 participants who had a completed pregnancy, the pregnancy resulted in a live birth in 712 (86.1%), in a spontaneous abortion in 104 (12.6%), in stillbirth in 1 (0.1%), and in other outcomes (induced abortion and ectopic pregnancy) in 10 (1.2%).’ 12% / 104 had a spontaneous abortion. Not that much, right? But then you notice, in the fineprint, 700 / 86% of the women had received a dose of either the Pfizer or Moderna Covid-19 vaccine during the third trimester of pregnancy. The third trimester of pregnancy is from week 27 – 40, and it is therefore impossible to suffer a miscarriage due to the fact they are considered as occurring prior to week 20 of a pregnancy. This means just 127 women received either the Pfizer or Moderna Covid-19 vaccine during the first / second trimester, with 104 of the woman sadly losing their baby. Therefore the rate of incidence of miscarriage is 82%, not 12.6% as presented in the findings of the study. — ‘Worrying’ numbers of pregnant women in intensive care with Covid https://www.theguardian.com/world/2021/aug/09/worrying-numbers-of-pregnant-women-in-intensive-care-with-covid — In case it’s not obvious, they still don’t know the long term effects. I made a post about the Japanese study showing mRNA carrier particles (lipids) concentrating in the ovaries, and it’s a logical conclusion that if your ovaries are getting messed with your fertility and/or pregnancy will be affected in some way. There were plenty of anecdotal cases of women getting absolutely bizarre periods post-shot and that should already be cause for extreme concern. @la-perfide-albion since you asked for a source on the miscarriages", "target": "None"}, "39": {"text": "atron-saint-of-smart-asses: “The sexist abortion mentality says that “women are not ‘strong’ enough to survive an unplanned pregnancy, much less to raise an ‘unwanted’ child or endure giving it up for adoption. Instead of helping women to be strong, independent, and capable of handling their lives in spite of the social prejudices against ‘problem’ pregnancies, the expediency of abortion encourages women to be weak, dependent, and incapable of dealing with unexpected challenges” (128).” — Nancyjo Mann, founder of Women Exploited by Abortion, “Catholicism & Society: Marriage, Family, and Social Issues” (via takineko)", "target": "None"}, "40": {"text": "healexiscowdell: President Joe Biden’s s pro-migration border chief is rewarding roughly 40,000 African economic migrants by granting them work permits and legal status. from Breitbart News https://ift.tt/Faz0Rhc", "target": "None"}, "41": {"text": "oudlytransparenttrash: Democrats recently announced a commission to study the feasibility of giving reparations to every black American as a way to soften racial tension, or something. Though one of Biden’s senior advisers declared that black America isn’t going wait for a committee or study. “We don’t want to wait. We’re going to start acting now,” said senior adviser Cedric Richmond. Not only would black Americans receive direct financial handouts for being black, the proposition is to also make it so that “homes are not valued less than homes in different communities just because of the neighborhood it’s in.” This apparently involves some type of government manipulation to ensure that homes in crime-ridden and gang-infested areas are forced to go on the market at the same price as houses in the Hamptons. But in what world would somebody pay the same price? When Richmond was asked how exactly that could be done, of course he couldn’t come up with an answer. Rep. Sheila Jackson Lee, who advanced the reparations bill currently making its way through Congress, said that giving black people free cash is “a way to bring the country together,” despite only 29 percent of Americans supporting it, including only 1 in 3 Democrat voters. Here are nine reasons why slavery reparations today is stupid: 1. There is no one group responsible for slavery The slave trade was for a thousand years already established in Africa, Asia and the Middle East before Europeans showed up. Muslim slave traders took twenty times the amount of African slaves. Slavery was part of every civilization on the planet, it has been part of the economic structure in every single country’s history, every race have either taken slaves or have been enslaved - including whites. The earliest recorded slaves were Europeans enslaved in North Africa. It’s America who has the shortest and smallest history of slavery compared to any other part of the world, yet America is cast as solely responsible. There were 10.7 million African slaves during the Atlantic slave trade, but only 3-4 percent of those, or about 380,000, were taken to North America. Almost all slaves were taken to South America and the Caribbean, not the U.S. Plus, by 1830 there were almost 4000 black slave owners in the U.S, owning 13 thousand slaves. Who exactly today are we holding responsible for slavery? 2. America was not built on slavery America did not get rich from slaves, the North had a thriving industrial economy, they produced 94 percent of the country’s iron, 97 percent of is coal, built majority of the railroads, did 75 percent of the country’s farming, produced 60 percent of its livestock, produced 17 times more cotton and woolen textiles than the South, and all in all they held 75 percent of the nation’s total wealth - all without slaves. Sure, most of the South’s economy was built on slaves picking cotton as the South had little manufacturing capability, but remember the South’s economy crashed to zero after the civil war and it was rebuilt without slaves, so it’s absurd to suggest America was built on slavery. Also, what’s with this “400 years of slavery” thing? If we use 1619 as the beginning and the 1865 13th Amendment as its end, that’s 246 years, not 400. 3. There is no one group that has benefited exclusively The claim for reparations is premised on the false assumption that only white Americans have benefited from slavery. If slave labor created wealth for white Americans, then obviously it has created wealth for black Americans as well. Black buying power is $1.4 trillion, that is so much combined spending power that it would make black America one of the largest economies in the world in terms of Gross Domestic Product. Black Americans earning $75,000 or more per year are growing faster in size and influence than whites in all income groups above $60,000. The black middle-class in America is a prosperous community that is now larger in absolute terms than the black underclass. Also, unless you don’t have a phone, Nike sneakers, clothes, chocolate or anything battery operated, you are benefiting from slavery and it’s about time you start paying up reparations, hypocrite. 4. America today is a multi-ethnic nation and most Americans have no connection to slavery We already know there was only a tiny fraction of white slave owners in America, so expecting 250 million white Americans today to pay for a crime that they or their ancestors played no part in, is beyond dumb. Many whites are recent immigrants. The two great waves of American immigration happened after 1880 and then after 1960. What rationale would require Russian refuseniks, Armenian victims of the Turkish persecution, Jews, Greeks, Polish, Hungarians to pay reparations to black Americans? Are we supposed to track the ancestry of everyone until we find the few who had slaveholder ancestors hundreds of years ago, and then tax them for reparations? To cover the trillions of dollars in cash reparations, it means all Americans would be forced to pay for something they didn’t do, which doesn’t sound “equitable” or like justice to me. 5. Previous precedents used to justify reparations do not apply Reparations were meant as payments to immediate family or direct victims of injury caused by injustice. This bill being pushed through Congress would be the only case of reparations to people who were not immediately affected and whose sole qualification to receive reparations would be their skin color. Reparations has never been about giving free stuff to random people who share the same skin color as those wronged centuries ago and neither should it ever be. It’s an attempt to ripoff the system and they know it. 6. America didn’t start slavery, it ended it Slavery existed for thousands of years before the Atlantic slave trade was born, and in all societies. But in the thousand years of its existence, there never was an anti-slavery movement until the English and Americans created one. If not for these anti-slavery attitudes and military power of the English and Americans, and if not for the deaths of hundreds of thousands of Americans, slave trades around the world would not have been brought to an end. For all America’s faults, our country was the first to end slavery, long before any other part of the world. It’s over now, we are no longer slaves, we aren’t slave masters, we aren’t oppressed and we aren’t oppressors. 7. The argument is based on the unfounded claim that all black Americans suffer from the economic consequences of slavery No evidence-based attempt has been made to prove that living individuals have been adversely affected by a slave system that has long ended. But there is plenty of evidence the hardships that occurred were hardships that individuals could and did overcome. Look at the earliest Asians to immigrate to America. The “coolies” were imported by the power brokers to work on major infrastructure projects and they were treated no better than African slaves, but there is no lingering legacy of the coolie system because their decedents have worked hard to put that era behind them. Asian Americans are now the most educated and highest earning people in the country. If only white people can be successful in America, then why are minorities such as Filipino, Taiwanese and Indian Americans doing far better on average than white Americans? Everyone has history of slavery and injustice, why should black Americans be the only ones refusing to better ourselves? What Asian Americans have proven is that privilege in America is based not on race but on merit. People of any race can succeed in America if they take education seriously, develop a positive work ethic, obey the rules and maintain strong relationships and families. 8. One more attempt to keep black Americans dependent on government The renewed sense of grievance and victimhood which is what the claim for reparations inevitably creates is neither a constructive nor a helpful message for black leaders to be sending to black youth and communities. To focus your entire mindset and narrative on the past instead of the future will only continue to kill any progress that no amount of cash handouts can fix. Spending all your efforts demanding others to pay you for doing nothing and to give you things for doing nothing, instead of wanting to pay for it yourself or earn it yourself is a tragic mindset to live in. What happens after you spend the cash? The country is now bankrupt and nothing has changed. I support programs and efforts dedicated to improving black lives, families and education, but if we’re going to spend money, it has to be used to create more permanent and constructive changes, not shameful, short-term appeasements. 9. Reparations to black Americans have already been paid Since the passage of the Civil Rights Acts and the advent of the Great Society in 1965, trillions of dollars in payments have been made to black Americans in the form of excessive welfare benefits and affirmative action programs in both employment and education, all under the rationale of redressing historic racial grievances. It is said that reparations are necessary to achieve a healing between black and white Americans. If trillion dollar restitutions and a wholesale rewriting of American law in order to accommodate racial preferences for black Americans is not enough to achieve a “healing,” what ever will? The answer is nothing will ever be good enough because if it ever were, then the excuses would have to stop. In return, accountability will take its place, which even just mentioning the word makes reparation-pushers wince. It’s healthy to be aware of past wrongdoings, mourn and condemn past atrocities, but that must apply to all of us, not just those of a certain race we can blame all our problems on. If we’re going to cast blame and justify hatred on white people today for the slavery and atrocities committed throughout American history, then we are no less innocent for the slavery and atrocities committed throughout African history. We can either keep throwing stones from within glass houses or we can let go of the divisive and separatist policies and sentiments and continue building the most free, fair and successful futures for all Americans. We should never ignore or forget our history, we just need to learn from it, never repeat it and stop taking advantage of it to get free stuff today. Hey I’m Irish there were Irish slave we get money too", "target": "POC"}, "42": {"text": "olt64: yeeowch! *is torn asunder*", "target": "None"}, "43": {"text": "lso as a side note, saying ‘sounds terfy’ every time someone says the word misogyny or patriarchy is literally just ceding ground to terfs for no reason. the only people who benefit from the idea that just… talking about feminism in any capacity makes you a terf are 1) the kind of men who materially benefit from women not talking about feminism, and 2) terfs, who would LOVE it if people believed there was no way to talk about feminism without being a bigot", "target": "None"}, "44": {"text": "atsen13: kerolunaticat: dukeofbookingham: furryarbiterangel: infinitelyblankpage: lmorasey: generalistherbalist: hattedhedgehog: everystarstorm: phantoms-lair: jabberwockypie: ariibatchelder: thatsnicebutimmarried: musicalhell: valeria2067: marvel-lucy: cassiopeiassky: angryschnauzer: mistytang: ivegotthetriforce: deliciouspineapple: annerocious: Lesser known facts when writing women: High heeled shoes don’t become flats if you break the heels off. The posts of earrings aren’t sharp. Nail polish takes a long time to dry and smudges when wet. You can’t hold in a period like pee. Inserting a tampon is not arousing or sexual in any way, ever. Feel free to add your own. - Bras leave red marks on the skin under and around boobs and it is a magical experience when taken off. - Make up can take anywhere from 5 to 25 minutes depending on how skilled you are. - Taking hair out of a ponytail after wearing it for hours does not make it perfectly straight when it comes down. - Hair when wet sticks to the skin it no longer flows, idiot. -When women with long hair kiss, turn around, do anything, their hair falls in the way. - Stockings are itchy and tear like wet paper bags. - Pantyhose, tights, leggings, and stockings are each different. - Waxing hurts and leaves red skin for a while afterwards while shaving leaves stubble - Most can’t run in heels unless they have been VERY worn - Insecurity in appearance doesn’t mean “buy me a drink” - EVERYONE HAS DIFFERENT TASTES IN EVERYTHING -Having large breasts sucks. It sucks beyond belief. If a garment happens to fit your large chest, odds are it won’t fit the rest of you. Underboob sweat is real and terrible. Bending over for extended periods of time will tweak your back out. Running can be painful due to boob turbulence. Bras are hella expensive. Big breasts are not fun. Putting a tampon in isnt a quick bend-poke-done kinda deal. It involves cubicle yoga, messy hands, numerous curse words as you realise it isnt in correctly and have to take it out and start again with a new one. Yes to all of this. But also: If her hair is in an updo, one does not simply remove a hairpin to send her hair cascading down her back. No. If her hair is an updo, it will take at least an hour and an extra set of hands to remove the 137 bobby pins that are holding her hair in place. Furthermore, there’s probably a can’s worth of hairspray in there, intended to withstand category 2 hurricane winds. There’s no cascading happening here - the best you can hope for is a misshapen nest of hair to clump and poof unattractively in the back while it still remains flat against her scalp. This is one of the funniest posts I’ve seen in a while (especially if you read all the comments), but also really depressing because at 42 I still judge myself as having failed for not matching up to all these mythical stereotypes despite knowing they’re impossible ^^^This though The odds of a woman having smoothly shaved legs and armpits are directly proportional to the amount of skin her clothing bares and/or the amount of fucks she gives at that particular moment. GLASSES ARE NOT COSMETIC. If we whip them off, we do not become gorgeous fashion models. We become squinty. -most women wear bras. Yes, even when they are trying to dress sexy. Because bras make boobs look perkier and rounder, which is something men apparently find sexy, so being a seductress or femme fatale is not an automatic reason for a female character to not be wearing a bra. -a good bra will hide headlights, or at the very least drastically reduce their noticeability. A women with enough pointy nipple issues will opt for a padded or molded bra to hide them. -women’s nipples do not automatically become hard pyramids visible through any and all layers of clothing the second they become even slightly aroused. They are not the female equivalent of boners. And even if their nipples do get hard, the bras they are almost certainly wearing (because even a goddamn succubus with big, honkin’ knockers for seducing men is gonna have those painful puppies in some kind of boob sling) should keep those pointy nipples from being visible to every other character in the scene, JIM BUTCHER. YES, EVEN LARA RAITH WOULD WEAR A BRA ONCE IN A GODDAMN WHILE. if you’re being tied up and tortured in a freezing underground dungeon, then you probably have more important things to pay attention to than how hard somebody’s nipples are, jim butcher - Wearing a bra that doesn’t fit HURTS. It’s not sexy to wear a bra that’s “two sizes too small”, it’d make your clothes hang oddly and you’d have a weird, uncomfortable “quad-boob” effect and your back would hurt, BEN AARONOVITCH. Also, after removing a too small bra, there’s gonne be angry red lines on the boobs and ribs and the lady is not going to want them to be touched by anyone for a good long while -Not all women wear heels. Those things hurt and are hard to balance in. They can also mess up your feet and back pretty bad. -Lips aren’t just naturally red “as if she’d been drinking wine but they were just like that without makeup cause she’s so perfect,” my dear little Kvothe from ‘Name of the Wind’. Also, girls do not naturally smell like fruit or flowers, it’s either perfume or something she’d been eating recently. I’ve been appreciating this post but now it’s back very specifically calling out my problematic faves and I don’t think those male authors realize how much it totally takes me out of the story for a moment when they commit these errors. It does nothing useful for the plot and is annoying for half of the audience Is it weird that I’m female and wasn’t aware of a solid third of these? I mean, all writes take note. I basically live in man land when it comes to protagonists so I don’t know half these things despite being a woman (Most) Women do not look at themselves in the mirror and compare their breasts to fruit. Any sort of fruit. Especially melons. Please save us from the melons. Also we are not aware of our breasts at all times. I do not walk down a flight of stairs and think “oh golly my breasts are bouncing so much right now”. They are as much as natural part of our bodies as arms. Do you constantly think about how your arms are moving? Sure you may be aware of them, but paying full attention? Doubtful. Also: women working out are almost never sexy. They’re not glowing or glistening or (kill me) *sparkling*. They are red and sweaty and gross just like all the dudebros doing their time with the dumbbells. Stop ogling fictional women at the gym, TOM WOLFE. I love this post. How and How Not to Write A Woman.", "target": "None"}, "45": {"text": "uffalojill: Trans men talking about trans men specific issues really wouldn’t be an issue if 90% of it wasn’t phrased in a way that implies trans women are somehow celebrated or privileged for not being transmasc or that we somehow hold power over trans men", "target": "None"}, "46": {"text": "uasi-normalcy: quasi-normalcy: quasi-normalcy: What I can tell you as a transgender woman is that occasionally I will read trans woman characters written by cisgender authors. And I can pretty much always tell when the author is cis, even if the character is portrayed respectfully, because they get some details wrong or something. But I certainly don’t think that they shouldn’t be allowed to take a stab at it, and I actually appreciate any representation that isn’t egregiously harmful. And I certainly don’t think that only transgender women should be allowed to write transgender women because then it falls on me, and that’s rather tokenizing, isn’t it? Also it seems like demanding that only #OwnVoices authors should be allowed to write certain characters is an excellent way to enforce a situation where most books are about cishet white people. And no: you probably won’t get all of the specific details of someone else’s lived experience correct, in much the same way that most authors don’t get all of the specific details about how, say, nuclear reactors or space work. But so long as your character passes as realistically human and not a one-dimensional caricature of what you think that other types of people are like, then I think that that’s reasonable.", "target": "None"}, "47": {"text": "eplercryptids: i love seeing the boosting of bail funds for protesters that are going around right now. i wanted to share a list of (US) community bail funds that are always in need of donations and support. please consider making small, regular donations to a bail fund local to you in order to support your community fight an unjust, corrupt legal system. and please share! (full directory is here and i’ve specified whether the fund is for pre-trial or immigration services, if the name of the fund doesn’t already do that!) National Haitian Immigrant Bond Assistance Project (immigration) LGBTQ Freedom Fund (immigration) Alabama Mongomery Bail Out Fund (pre-trial) Etowah Freedom Fund (immigration) Arizona Tucson Second Chance Community Bail Fund (pre-trial) Pima Monthly Meeting Immigration Bond Fund (immigration) California (all immigration) Al Otro Lado Vida Libre Bond Fund - Southern California Bay Area Immigration Bond Fund - State-wide Familias Reunidas Immigration Bond Fund - San Diego area Freedom for Immigrants Bond Fund - Adelanto Only ICIJ Bond Fund - Inland Empire Immigrant Families Defense Fund- Alameda County Orange County Justice Fund - Orange County NorCal Resist Sacramento Region Bond Fund San Diego Immigrant Rights Consortium Borderlands Get Free Fund - Southern California Colorado Colorado Freedom Fund (pre-trial) Immigration Freedom Fund of Colorado Connecticut Connecticut Bail Fund (pre-trial) Immigrant Bail Fund Florida LGBTQ Freedom Fund (pre-trial) Georgia Georgia Immigration Bond Fund Hawaii Hawaii Community Bail Fund (pre-trial) Illinois Champaign County Bailout Coalition (pre-trial) Chicago Community Bond Fund (pre-trial) Iowa Eastern Iowa Community Bond Project (immigration) Kentucky Louisville Community Bail Fund (pre-trial) 3R Fund for Immigrants Louisiana New Orleans Safety & Freedom Fund (pre-trial) YWCA Greater Baton Rouge Community Bail Fund (pre-trial) Freedom for Immigrants Bond Fund Massachusetts Massachusetts Bail Fund (pre-trial) Beyond Bail & Legal Defense Fund (immigration) Michigan Kent County Immigration Bond for Our Neighbor’s Defense Fund Minnesota Minnesota Freedom Fund (pre-trial & immigration) Missouri Kansas City Community Bail Fund (pre-trial) Race Matters Friends Community Bail Fund - Columbia, MO (pre-trial) Reale Justice Community Bail Fund - Kansas City, MO (pre-trial) Nevada Vegas Freedom Fund (pre-trial) Las Vegas Family Unity Bond Fund - Arriba Las Vegas Workers Center (immigration) New Hampshire NH Conference UCC Immigrant and Refugee Support Group Immigrant Bond & Support Fund New Jersey First Friends of NJ & NY Bond Fund (immigration) New Mexico Fronterizo Fianza Fund (immigration) New York Emergency Release Fund - New York City (pre-trial) OAR of Tompkins County Bail Fund (pre-trial) Syracuse Jail Ministry (pre-trial) LIFE Bond Fund (New Sanctuary Coalition) (immigration) New York Immigrant Freedom Fund (Brooklyn Community Bail Fund) North Carolina Alamance County Community Bail Fund (pre-trial) North Carolina Community Bail Fund of Durham (pre-trial) Ohio 3R Fund for Immigrants Oregon Portland Freedom Fund (pre-trial) Pennsylvania Bukit Bail Fund of Pittsburgh (pre-trial) Dauphin County Bail Fund (pre-trial) Philadelphia Community Bail Fund (pre-trial) Philadelphia Bail Fund (pre-trial) Community Fund for Bond and Legal Support (immigration) Rhode Island AMOR Bond Fund (immigration) Tennessee Hamilton County Community Bail Fund (pre-trial) Memphis Community Bail Fund (pre-trial) Nashville Community Bail Fund (pre-trial) Texas Luke 4:18 Bail Fund (pre-trial) Fronterizo Fianza Fund - El Paso area (immigration) Hutto Community Deportation Defense & Bond Fund - Austin area (Hutto) RAICES Texas Bond Fund - state-wide TX (immigration) Vermont Vermont Freedom Bail Fund (immigration) Virginia Richmond Community Bail Fund (pre-trial) Roanoke Community Bail Fund (pre-trial) Cville Immigrant Freedom Fund Washington Northwest Community Bail Fund (pre-trial) Fair Fight Immigrant Bond Fund Wisconsin Free the 350 Bail Fund (pre-trial)", "target": "None"}, "48": {"text": "m really happy people like my muslim jon stuff but it is also kind of depressing that me drawing 2 comics with Jon as muslim is more muslim rep than most of the podcasts ive listened to", "target": "None"}, "49": {"text": "isibilityofcolor: visibilityofcolor: visibilityofcolor: visibilityofcolor: i’m starting to like white trans people less and less. a lot of you will see black trans people calling you out for racism and call us transphobic, aggressive, or say we’re harassing you. do y’all not really care about making black people feel safe in this community. and if your white followers are spreading rumors about black trans people who checked you on your racism then why are you need to call them out. but of course you won’t, because if white trans people don’t have racists defending them then what do they have. white trans masc, trans fems, nonbinary people, etc., will find anything just to say black trans people are harassing them. i have seen all types of white trans people, even go against their OWN beliefs if it means harming black trans people. it’s really really gross. you will coddle racists, you will completely drop your ideals and support transphobic and tranmisogyntistic people if it means shitting on black trans people. and i do get that not all white trans people are racist but i think for white trans people who want to be allies, you have to do a better job at calling out racist within your community, please do that. anyway, if you are a white trans person you should probably share this. there is a lot of unchecked anti blackness that goes on in your communities to the point where you’ve completely ostracized black trans people.", "target": "other"}, "50": {"text": "agfrog: fagfrog: fagfrog: when someone is a christian they are not constantly asked their position on the holocaust the transatlantic slave trade the extermination of native americans or any of the thousands of atrocities committed by christians so why do muslims get asked about terrorism and jewish people about israel and are grouped in with specific bad people while christians are not required to explain themselves?? goyim and non muslims can and should reblog [christians and all sectors of christianity that means you]", "target": "None"}, "51": {"text": "eel-sakinah: The traditional young person, especially the male I suppose, was initiated. In every culture, there was an initiation by the elders of the teenager, which was an initiation into manhood, but also into the belief system and the moral system of the tribe. That’s fundamental to being part of the human family. We have always had those rituals and those ceremonies. And part of that is the lesson of overcoming self and exploring transcendence. So, modernity only believes in nafs (desires). We believe in ruh (soul), and the nafs being something that is a kind of trap, an illusion, unreal. And all of the religions really agree on that. This is not specifically Islamic. So the big fight, the futuwwa (virtue) for young people has to be overwhelmingly against the lower self. Unless that is subdued and one becomes a beautiful, balanced, restrained, courteous person, full of compassion rather than anxiety, one is never going to overcome any of these issues. One becomes just another turbulent, shouting voice in the crowd. We need to reinvent, rediscover those traditions of futuwwa. And I am probably not making many friends because I am very critical of Sufism in the West, and the fact that the traditional policy of the ummah (Muslim nation) when it expanded into a new territory was, first of all, before the muftis or the qadis (judges) or any of that got going, was to create the Sufi lodges and the shrines and that infrastructure which was the network of Islamisation. We haven’t really done that in the Western world. And as a result there is a whole dimension of the religion and the deepening of peoples’ faith that is simply absent and there is no access to it. Where do you go if you want to go to a Muslim retreat centre, for instance, for the weekend? You can do it with the Buddhists or the Christian monasteries. Where do you do it in Australia for instance? Are there established places the way there used to be across the Muslim world? Plenty of Turks in Australia. Before Ataturk there were 400 Sufi lodges just in Istanbul. It was just part of Muslim life. For the training of akhlaq, adab, futuwwa (virtue, morality, and etiquette), sacrifice, beauty. Where is that now? So we need to deepen our infrastructure I think, and that’s where young people, especially young men, need to be. -Sheikh Abdul Hakim Murad (may Allah grant him long life).", "target": "None"}, "52": {"text": "adblackgirl: carefree black girls quiet black girls hood black girls headbanger black girls shy black girls fearless black girls hotheaded black girls stubborn black girls spiritual black girls introverted black girls independent black girls slutty black girls asexual black girls hyper-feminine black girls potty-mouthed black girls bald black girls cute black girls squeaky voiced black girls b l a c k g i r l s", "target": "None"}, "53": {"text": "osepetalbisous: i feel like, and this is a hot take, the demonization of femininity and trying to force “strength” as a woman onto black women is heavily flawed and *very problematic considering that men entering feminism try to cherry pick what applies to them anyway and placing strength and independence on women romantically i.e, shaming them for having traditional ideals, trying to convince them to pay for a date, shaming them for wanting to be provided for by a husband/boyfriend, etc., are not necessarily new for black women. The idea of going half being liberating for women feels like a very non-black idea considering that the only time black women are seen or treated as…women is when we’re sexualized against our will or expected to nurture everyone while they abuse us. Let us have a chance to experience the good side of femininity and let the way we expect to be treated romantically be a black topic and not a feminist topic because not all women are treated equally.", "target": "None"}, "54": {"text": "ownlowininglewood18: nastybimale215: The bisexual double standard Growing up in Philadelphia as a young black male i knew i was different from all the other males around me i kept have fantasies of guys but at the same time i was still into women. First i thought am i gay ? But i thought gay men don’t wanna have sex with women. It took me a long time to come to terms that I’m a black bisexual male. Now i understand the stigma when people hear you are a bisexual male,they think you are having unsafe sex with every guy you see and can’t say no to anyone. That’s so far from the truth yes i like doing sexual things with guys but it doesn’t mean I’m unsafe or i have a STD. It also doesn’t mean i can’t be faithful when i am dating a woman. I see many bi women especially in the black community who get a pass even if they did something with a girl just to try it people will still respect them and they have no problem dating. When it comes to bi black men ,the minute women meets a guy then he tells her he has sexual feeling or he has experimented with his sexuality automatically he’s gay and less of a man and they say men can’t be bisexual , they won’t date us because they afraid we be thinking of a man when they have sex with us or we will end up being gay. I truly don’t get why women get a pass on this but us bi men are forced to be looked at as men that women never wanna date. It’s unfair but we live in a unfair world. I have even had times when i would meet another bisexual woman and i tell her I’m bi but she judges me calls me nasty and says am i sure i don’t have any STD’s ? This type of judgement forces many bisexual black men to hide and not open up to women . A lot of us don’t want to hide many of us want to be open wth the woman we are dating and still be looked at as a strong man. We also don’t want our business not to be shared with your family,girlfriends and most of all social media. People always say just be honest but look at the back lash we might get from it. My friends and family have no need to know my sexual preference. The only person i want to share that with is the woman I’m dating. I can only speak for myself when I’m looking for a woman to date i tend to look for women who are open to bisexual men,but as you already may know it’s so hard. Many many women especially black and Latino women are against us. It’s one of the reasons I’m single now. I have only been in Tumblr for short period of time and i don’t see many pages that carter to bisexual men . I truly would like women to get to know us with out judgement . We are normal men you see every day in the street. I know i will get a lot of nasty messages from women calling me all kinds of names. I hope i am wrong. Yes my page has a lot of porn on it that’s just my sexual side. If you take time to get to know me you might like me. Bi make right here", "target": "None"}, "55": {"text": "onarchalchemist: and they’re right, the best place to hide a tree is in a forest; we spent lifetimes behind walls clusters of blocker frequencies designed to diminish our potential and here we are atoms floating in god’s amnesia architects of our own destruction", "target": "None"}, "56": {"text": "elelvance: Let women be unemployed losers", "target": "WOMEN"}, "57": {"text": "lurpy-swamp: i think women are really hot when they’re evil and fucked up in a distinctly unhinged and hubristic power-mad way", "target": "WOMEN"}, "58": {"text": "nneskeeper: canadianwheatpirates: inneskeeper: inneskeeper: Actually I think I 100% just cracked why reactionary radical feminism on tumblr ended up leaning so hard into genuine misandry and how so many of them got into being transphobes. The year is roughly 2012-2015. You are a high schooler or young college student and Tumblr is at its popularity peak. This is also just after federal gay marriage in America was passed, and it ended up revealing to public eye and public popularity that, wait, there’s also a lot of other fuck shit going on, including systemic misogyny and sexism in a patriarchal society! Oh no! Now, the easiest way to show you support women and feminism with your whole chest during this period was that we all discovered the concept of radical unlearning, so we all supported women and each other as feminists by going to an EXTREMELY anti-man as a concept at all, mostly without any real ideology behind it. Talking about how men all suck wasn’t actually about men at all, it was just a way to elude to the fact that women deserve better than what they’re getting, right? The subtext and context was important. But see, the problem is, when you’re participating in radical unlearning, it is REALLY easy to accidentally trip and fall into focusing way too much on the radical part of that unlearning. So now the statement “Fuck all men, they’re trash” became “I hate all men because they’re all evil and abusing women systemically”. The ideology shifted away from the subtextual focus of “We’re learning how to support women” and went, for a group of us, into “We are going to blame men unilaterally for all of womenhood’s systemic struggles.” This is of course absolute bullshit and unfortunately now the phrase “not all men” is super ideologically poisoned because no matter how true it is, it was used too much by misogynists so now actual feminists can’t address the issue of “Hey uh. This may be not great as an ideological concept” without everyone going “So you’re definitely basically a rapist and hate all women”. And that’s where the shift happened. Because the focus was kept so much on the radicalization of “all men are fundamentally bad”, that then needed to define what a man was. That way you knew who to avoid because of their ability to harm you as a woman. And so that’s what led to the radical bioessentialism of “man = penis” and the TERFs got a whole new generation of fresh young faces during the spread of fourth wave feminism. Whoops. If I may – there was also a rhetorical dodge spread around this time to avoid dealing with intersectionality in any meaningful way (because if we fully apply intersectionality, we find that some women have power over marginalised men and that doesn’t fit with men being the source of all problems). When issues of e.g. white women having privilege over Black men in many situations were raised, white people like myself were taught to go “well, all other things being equal, Black men have privilege over Black women :)”. You will notice that this isn’t actually intersectional and doesn’t answer the question of Black men’s position relative to white women at all, but it’s a good way of looking like you’re using intersectionality correctly when you aren’t. Often we’d take the dodge further and basically go “if you want to learn about racial oppression, you only have to listen to Black women, because they’re more marginalised than Black men”, as if Black men and women experience the exact same things but Black women experience them Worse, as if “man” isn’t a gender that can have its own interactions with marginalisation that play important parts in how those marginalisations affect everyone. So, yeah, that shit sucks and anyone who still does it should stop doing it. Oooooo good catch with that too! Wow tumblr’s history of performative ideological purity over actual and meaningful direct action really does just go back a solid decade and change lmfao christ", "target": "None"}, "59": {"text": "ueeranne: I wish all women were safe", "target": "None"}, "60": {"text": "etting sick of seeing all these feminist mothers day posts. Funny how women get a “mother’s day” just because they’re women. Where are the days for fathers?", "target": "WOMEN"}, "61": {"text": "ames-tha-bean: theultimatemgtow: Why do women even need gynecologists? It’s just another excuse for women to pretend their vaginas have so many problems and get the gender oriented pity party they crave. In reality, it’s little more than a pussy social visit and a puff of perfume. Let’s face it. If womens vaginas really did have enough problems to warrant going to a doctor, then that’s because they can’t keep their legs closed and use them too much to manipulate men. This is why I’m MGTOW. For the record, there’s a medical specialty called urology which is specifically a penis doctor. Women only need to go to a gyno if they’re sexually active or have a specific problem. Well of course there is. Men have to make sure their penises and prostates get checked regularly and remain in good health.", "target": "WOMEN"}, "62": {"text": "hy do women even need gynecologists? It’s just another excuse for women to pretend their vaginas have so many problems and get the gender oriented pity party they crave. In reality, it’s little more than a pussy social visit and a puff of perfume. Let’s face it. If womens vaginas really did have enough problems to warrant going to a doctor, then that’s because they can’t keep their legs closed and use them too much to manipulate men. This is why I’m MGTOW.", "target": "WOMEN"}, "63": {"text": " wish I lived in Japan. At least all the women there are high class, appreciates anime, are submissive to men, are completely loyal, and they always wear those cute schoolgirl clothes.", "target": "other"}, "64": {"text": "winkrundgren: twinkrundgren: twinkrundgren: more and more every day i develop more hatred towards radical feminism and people who adopt their ideas and call themselves trans friendly because they know what transmisogyny is youd rather demonize maleness than deconstruct the patriarchy and the structural power cis men have and wonder why your anti male posts get terfs in the notes. hint it doesnt matter if YOU don’t think trans women are men. if the only difference between you and terfs is that you dont misgender trans women i dont want to hear what you have to say. you’re one hop, skip, and a jump from coming to the same conclusion anyway. as long as you believe maleness and masculinity are inherently evil, abusive, and Oppressive, you are not an ally to any trans people except ones that are feminine enough for you. you are not an ally to bigender people, amab nonbinary people, or transmasculine people. you aren’t even an ally to butch trans women, because as soon as a trans woman steps out of line, you bring up her “male upbringing”. as long as you can draw a line between your Unruly Trans Person and Maleness, you win! Because, don’t you know, maleness makes you evil? you are unable to see past your elementary understanding of why cis men have so much power over us and you will always, always, hurt queer people more than you’ll ever deconstruct the patriarchy and male privilege in your spaces. you do not get to replace biological essentialism with gender essentialism.", "target": "None"}, "65": {"text": "alllen: Islam is NOT a religion of peace I don’t care if your holy book says lots of nice things, it still has hundreds of verses calling Muslims to kill unbelievers/women/homosexuals(47:4). If you’re a Muslim and you deny that, than you either don’t know what you believe or you are cherry picking the Koran. So many people, in an effort to keep the peace, have insisted that we tolerate people’s religions in order to bring about acceptance. While I fully accept Muslims as people, I do not accept anything about Islamic(or any other religious) ideology and will not be getting on the bandwagon of Islamic acceptance. Islamic ideology has no place in Western culture, where we value things like women’s rights, LGBT equality, and freedom of speech.", "target": "MUSLIMS"}, "66": {"text": "xmuslim-uk: nationalistic: In answer to the first moronic assertion by @feminismandmedia that most European Muslims don’t want Sharia, I present the actual statistics: WZB Berlin Social Science Centre: 65% of Muslims in Europe say Sharia is more important than the law of the country they live in. Center for Social Cohesion: 40% of British Muslims want Sharia to be enforced under threat of violence NOP Research: 68% of British Muslims support the arrest and prosecution of anyone who insults Islam MacDonald Laurier Institute: 62% of Muslims want Sharia in Canada Pew Research (2010): 82% of Egyptian Muslims favour stoning adulterers 70% of Jordanian Muslims favour stoning adulterers 82% of Pakistanis favour stoning adulterers Pew Research (2013): 81% of South Asian Muslims support amputating limbs for theft 2015 (Jyllands Posten): 77% of Muslims in Denmark believe the Quran’s instructions should be ‘fully applied’ Syarif Hidayatullah State University Study (2017): 80% of Islamic education teachers favour enforcement of Sharia; 89% say non-Muslims “should not be accommodated” in Indonesia. Now as for the second crybaby @meljane7, and another brilliant addition by @feminismandmedia asking “How is Islam misogynistic??”. Yes, real people actually wrote that. But luckily for them, I have in fact read and studied the Quran in depth, for this exact reason. I can now quote the vile book directly too you and it does the work for me! Isn’t that great? In Islam, a man is given the right to beat his wife until she obeys (Sura 4:34, Bukhari 8.73.68). According the Qur’an, “Men are in charge of women, because Allah has made some of them to excel others…and those on whose part you fear rebellion, admonish them, and leave them alone in beds apart, and beat them.” Oh and just in case you were considering defending spousal abuse in the name of tolerance, the Arabic word for beat used in the Qur’an is the same word used for the treatment of slaves and animals. Muhammad himself was a degenerate, licentious and vile man, he had thirteen wives, two forced concubines/sex slaves, and four other women with whom he had regular sexual relationships. Not to mention, by the way, that one of Muhammad’s wives was six years old when he married her, but nine years old when he consummated his marriage with her, so that’s okay, right? (See Aisha) Also of interest, Muhammad married his daughter-in-law Zainab (Bukhari 9.93.516-518). He arranged for his adopted son Zaid to divorce her simply so he could marry her. Faced with the refusal of Zaid to dissolve his marriage, Muhammad had another convenient revelation from Allah, which not only commanded Zaid to give up his wife to Muhammad, but also decreed that there was no evil in a father-in-law taking his daughter-in-law away from his own adopted son (Sura 33:36-38). Sura 2:223 explains that “Your wives are your fields, so go into your fields whichever way you like.” Is this how husbands should think of their wives? Is this an example of the perfect divinely inspired revealed truth dictated from Allah to Muhammad? No, feminists don’t support bigoted & hateful women, they are bigoted and hateful women. Now for the sake of @themixedfeminist let’s quickly compare what we have read so far to the Christian teachings about women, shall we? Y’know, the same Christian teachings you call misogynistic and that @meljane7 blamed for the problems in France and Europe today. Also, bear in mind Islam is hundreds of years more ‘modern’ than Christianity is, so of course Christianity will be even more barbaric and sexist, right? Wrong. Firstly please read this article, it details everything Christianity has done to improve women’s rights throughout history. Secondly, two books of the Old Testament are named for (and are about) women. Women play an even more venerated and prominent role in the New Testament, especially in view of the low status afforded women in the culture in which Jesus lived. Read Matthew 5:32; 1 Corinthians 11:11-12; Galatians 3:28; Ephesians 5:25-33. There are 21 notable women mentioned favourably in the New Testament. While the Bible teaches different roles for women than for men, the New Testament elevates women in many ways. It teaches, “Husbands, love your wives, just as Christ loved the church and gave himself up for her to make her holy, cleansing her by the washing with water through the word, and to present her to himself as a radiant church, without stain or wrinkle or any other blemish, but holy and blameless. In this same way, husbands ought to love their wives as their own selves. “He who loves his wife loves himself.” In stark contrast, let’s quickly go over some more Muslim attitudes to women: Prostitution is common in many Muslim countries, especially countries in Africa. Muslims justify prostitution by marrying the woman for the night, which seems to be ‘okay’ as long as they stay within the limit of four wives at one time. Genital mutilation of women is also a widespread practice in Muslim countries. In some countries 90% of women are so mutilated. The Qur’an and hadiths teach that it is morally acceptable to force women to have sex with their captors (Suras 4:24, 70:29-30; also Bukhari 8.77.600; 9.93.506; also Muslim Hadiths numbers 8:3371 and 8:3433). Islam teaches that the majority of people in hell are women (Bukhari 1.2.28, 1.6.301, and 2.18.161). According to the prophet of Islam, “I looked at Hell and saw that the majority of its inhabitants were women.” Passages from the Quran, Hadith and Sira: Quran (4:34) - “Men are the maintainers of women because Allah has made some of them to excel others and because they spend out of their property; the good women are therefore obedient, guarding the unseen as Allah has guarded; and (as to) those on whose part you fear desertion, admonish them, and leave them alone in the sleeping-places and beat them; then if they obey you, do not seek a way against them; surely Allah is High, Great.“ Quran (38:44) - “And take in your hand a green branch and beat her with it, and do not break your oath…” Allah telling Job to beat his wife (Tafsir). Sahih Bukhari (72:715) - A woman came to Muhammad and begged him to stop her husband from beating her. Her skin was bruised so badly that it is described as being “greener” than the green veil she was wearing. Muhammad did not admonish her husband, but instead ordered her to return to him and submit to his sexual desires. Sahih Bukhari (72:715) - “Aisha said, ‘I have not seen any woman suffering as much as the believing women’”, so Muhammad’s own wife complained of the abuse that the women of her religion suffered relative to other women. Sahih Muslim (4:2127) - Muhammad struck his favorite wife, Aisha, in the chest one evening when she left the house without his permission. Aisha narrates, “He struck me on the chest which caused me pain.” Sahih Muslim (9:3506) - Muhammad’s fathers-in-law (Abu Bakr and Umar) amused him by slapping his wives (Aisha and Hafsa) for annoying him. According to the Hadith, the prophet of Islam laughed upon hearing this. Abu Dawud (2141) - “Iyas bin ‘Abd Allah bin Abi Dhubab reported the Apostle of Allah (may peace be upon him) as saying: Do not beat Allah’s handmaidens, but when ‘Umar came to the Apostle of Allah (may peace be upon him) and said: Women have become emboldened towards their husbands, he (the Prophet) gave permission to beat them.” Muhammad saw that women were becoming emboldened toward their husbands, and decided that beatings in a Muslim marriage are necessary to keep women in their place. Abu Dawud (2142) - “The Prophet (peace be upon him) said: A man will not be asked as to why he beat his wife.” Abu Dawud (2126) - “A man from the Ansar called Basrah said: ‘I married a virgin woman in her veil. When I entered upon her, I found her pregnant. (I mentioned this to the Prophet).’ The Prophet (peace_be_upon_him) said: 'She will get the dower, for you made her vagina lawful for you. The child will be your slave. When she has begotten (a child), flog her’” Basically, a Muslim thinks he is getting a virgin, then finds out that she is pregnant. Muhammad tells him to treat the woman as a sex slave and then flog her after she delivers the child. Ibn Ishaq/Hisham 969 - Requires that a married woman be \"put in a separate room and beaten lightly\" if she \"acts in an inappropriate manner toward others.“ According to the Hadith, this can be for an offense as petty as merely being alone with a man to whom she is not related. Finally, Kash-shaf (the revealer) of al-Zamkhshari (Vol. 1, p. 525) - [Muhammad said] \"Hang up your scourge where your wife can see it” just so your wife is aware of what awaits her lest she refuses her husband sex or goes outside without permission. This is the belief system you are defending, you, as a feminist, are advocating the subjugation of women for the sake of political correctness. Open. Your. Eyes. This is the real face of Islam. Whether you like it or not, whether you believe it or not, this is what it is.", "target": "MUSLIMS"}, "67": {"text": "isp0sable–teen: its so hard to not become a misandrist when your dad is a muslim. i hate my father’s convictions so much. i just want to scream in his face, sit the fuck down youre not my fucking king. you will not marry me off to a man like you, to a muslim monster. nor do you have the right to do that. men get no say in who their adult daughters marry. men are not superior to women. men in a family are no more important than their wives. men are not the fucking supreme authority of their family. useless segregation of the sexes is fucking stupid. us girls and women have the right to go wherever we damn please without the permission of male relatives. who gets to see our beauty is up for us to decide, not you. YOU muslim men are stupid and backwards minded, not the western world. ppl wearing bikinis at the beach is not fucking “macabre” you idiot prude. god muslim culture is a crock of shit, someone pls make it disappear before it infests western societies any further. i cant wait to leave this family, go wherever i want whenever i want, dress how i want, talk with whoever i want however i want, play whatever instruments i want, cut my hair however i want, get a ton of tattoos, date ppl, be my “kafir whore” self in peace, and not see my idiot fathers ugly misogynistic face for as long as i live. fuck islam, seriously fuck it.", "target": "MUSLIMS"}, "68": {"text": "xmuslim-uk: potatoatheart: exmuslim-uk: I keep seeing Muslims (especially online) claiming that if a woman dresses modestly, she can prevent being raped. No. Rape happens to men. Rape happens to children and babies. Rape happens to nuns in habits and to women in burkas. Telling women, especially victims of rape, that they could have prevented it by dressing according to the Quran’s guidelines is disgusting, and it needs to stop. And this is known by many Muslims. Don’t blame Islam for those who do not understand rape culture. It doesn’t matter if you’re naked or in a burka you can still be raped. Islam IS rape culture. Within Islam, a man is entitled to his wife’s bodies, he’s allowed to have sex slaves and concubines, he can have sex with a 9 year old as long as he marries her first. If a woman doesn’t feel like having sex, angels will “curse her” for it. The whole point of the burka is to be modest enough so that men won’t rape you - apparently in Islam, it’s too much to ask to just be left alone. What about that says ‘consensual’ to you?", "target": "MUSLIMS"}, "69": {"text": "reethinkingbrokensoul: How does islam preach gender equality when women have to pray BEHIND men? Even in front of Allah, where everyone is supposedly seen as equal before his eyes, the women are the ones that must be in the back.", "target": "None"}, "70": {"text": "hemoonnchild: sewercentipede: sewercentipede: thank god for weird women, smart women, crazy women and lazy women thank god for loud women, anxious women, tired women, and messy women! Thank god for women", "target": "None"}, "71": {"text": "ome-random-radfem: I truly hate it when people act like there is no difference between women who hate men and men who hate women. The difference, for starters, is that men who hate women hate us for the body parts that we were born with, which is something that we have no control over, whereas women who hate men hate them for the way they treat us, which is something that men have full control over. Rapes, beatings, maimings, murders, denial of basic human rights. Men don’t have to act that way towards women; they do because they choose to. Yet, people expect us not to hate them for it? Fuck off! Men bring it on themselves. The difference is also that women who hate men strongly prefer to avoid men at all costs, whereas men who hate women want to invade our spaces and personally harm us. They want to rape us. They want to kill us. They want to permanently disfigure us. 137 women are killed by a partner or family member every day. In the United States alone, 1 in 5 women will be the victims of an attempted or completed rape within her lifetime, and many rapists are repeat offenders. Yet, you STILL expect us to like men?! Once again, fuck off. They brought it on themselves. Also, you are either a moron or a misogynist for thinking that misogyny and misandry are remotely the same. Maybe you are both, idk. Idc, either. I don’t know you, nor do I want to. Stay the fuck away from me until you manage to grow a spine and either learn to take criticism if you are a dude, or quit bending over backwards for male approval if you are a woman (btw, they will never do the same for you, just so you know). And learn some goddamn critical thinking skills; I don’t care what sex you are in that regard. Women do not have the same rates of criminal violence that men do, and, no matter how much we may despise men, misandry doesn’t exact the same consequences for physical violence that misogyny does. Everyone knows that. You would have to be an idiot to think they are all the same. No because the way they took the words straight out of my mouth.", "target": "other"}, "72": {"text": "lovestupidwhores: a-womans-natural-place: Bonus points in you live in NYC! Fuck feminists and feminism", "target": "WOMEN"}, "73": {"text": "IGGERS OUT OF EUROPE YOU DONT BELONG HERE YOU FILTHY MONKEYS", "target": "POC"}, "74": {"text": "AHAHAHA More like Black Lives Splatter", "target": "POC"}, "75": {"text": "omen May Need To Prove Their Not Pregnant to Buy Medical Marijuana in Alabama https://youtu.be/RDpONegG2-s", "target": "None"}, "76": {"text": "s California’s Cannabis Industry COLLAPSING? https://youtu.be/7XNdkk1WwAU", "target": "None"}, "77": {"text": "efend Europe Keep Europe White 14/88 Blood and Soil", "target": "other"}, "78": {"text": "e Europa need to close the borders to stop the 3rd world camel fuckers from flooding our country's ,Kick out the Zionist Jewish bankers and Save the white race", "target": "other"}, "79": {"text": "omen Belong In The Kitchen - Me", "target": "WOMEN"}, "80": {"text": "bh i dont think anyone actually believes jkr is a nazi extremist or w.ever. they just know if they call her out for saying trans women are not totally identical to cis women no one would care bc everyone agrees w common sense statements like that. so they have to drag every other -ism under the sun into the list of her supposed crimes to make her seem bad enough to justify their reaction", "target": "LGBT+"}, "81": {"text": "usansontag: the victim blaming and judgement from women who have never been in an abusive situation towards women who are or have been needs to be discussed tbh. it’s especially prevalent when child abuse is also involved. there’s this idea that oh, I would never be so pathetic or weak as to let my husband or boyfriend treat my children in this way. I’ve seen many average, even basically pro-feminist women express this view. if you’re an adult woman and you’re being abused but make no effort to fight back (in a way that’s acceptable) or your children gets hurt you are deemed almost just as culpable as your abuser. this comes from a place of fear, possibly, or just ignorance… a reluctance to understand the full control and destruction of your own will that abuse can bring about… likely again out of denial. but it’s very real and I’ve seen women proudly proclaim they have no sympathy for survivors of abuse if it fits this model. it’s so sad but needs to be challenged thoroughly imo", "target": "None"}, "82": {"text": "odenor: liberals be like stupid is an ableist slur. u can call women bitches tho", "target": "other"}, "83": {"text": "o i would not (and have not) called gay men slurs period no tampon blood everywhere. yes i think its insane that gay men have almost a free pass to be as misogynistic and evil towards women as they want (up to telling women theyre too stupid and dick obsessed to know whats good for themselves or even groping/assaulting women irl) and call women all sorts of horrible evil slurs while also freaking out when someone like azaelia banks says f*ggot like twice", "target": "LGBT+"}, "84": {"text": "ord-azrael: Post slavery, during Jim Crow laws: “ Black people are predatory to white women and children.” During Gay liberation movement: “Lesbains and gays are predatory to straight women and children.” Present day: “Trans people, especially trans women are predatory to cis women and children” And thus the nazis and Conservative’s bullshit and fear mongering goes on. And when they lose the current culture war, i wonder who they gonna target next…..", "target": "None"}, "85": {"text": "atara-radfem: monapill: gayfencingtongueegg: The thing about the “why is men wearing dresses okay, but blackface isn’t” type arguments is this: We judge gender on presentation, be it clothes or makeup. Things people, of ALL races, choose to do. Different countries and cultures have different standards. Race, besides also being a social construct, is judged on skin color. Skin color is immutable. Certain conditions can cause change over lifetime, but in the vast majority of people, that is not changable (tanning aside) We choose to wear certain clothes and make up. We don’t choose our skin color. Even if you go with “women were domestic slaves, like black people”, you forget two very important points: Black women were enslaved, too! White women had slaves, too! Black female slaves were stripped of their femininity, their heads often shaven, because they didn’t conform to the white beauty standards, and weren’t allowed to, either. If you really think “men in dresses” is anywhere close to blackface, you are just showing your white feminism. And, frankly, racism. I will not entertain this asinine, racist “argument” anymore. as a black woman, i don’t think males being feminine is on par with blackface. what i consider comparable to blackface is them taking estrogen & declaring themselves women. there’s no difference. women are female, black people are people with dark skin and african ancestry. a male calling himself a woman is just as offensive as a white person calling themselves black. a male saying he’s a woman bc he has feminine interests is like a white person saying they’re black because they like rap and fried chicken— utterly offensive & distasteful. id even argue that since sex is immutable and clearly defined, whereas skin tone (though not ancestry/ethnic background) can vary during one’s life, it’s even more offensive for a male to call himself a woman than a white person to call themselves black. no, males in dresses is not blackface , but males wearing dresses and declaring themselves women is absolutely just as bad. But I must say, some drag performances do feel very misogynistic Some drag performances deliberately mock women and stereotypes of women, because we are the butt of the joke. Men dress in exaggerated caricatures of femininity to mock the same demographic group (women) oppressed by femininity. It’s oppressors treating the group they oppress like a costume in order to mock that group. I don’t believe it’s just as bad as blackface but it’s close Wow. Anything to fit your narrative, huh? Drag shows celebrate femininity. They’re also fun, but I’m sure you never heard of fun before. Your lives sound utterly miserable, what with all the hate. Also. If makeup and clothes don’t make a woman, then how can it possibly be misogynistic? People can wear what they want, no? I’m always sorry for any black woman who falls for this white feminism, but it’s your choice. I know I can’t change your mind. Just don’t expect them to help you when they’re done with us. You are voting against your own best interests, just because you hate us so so much. You support people who’d throw you under the bus in a heartbeat. Who did to you what they now do to us. I’m sad you can’t see that. Just be aware you’re supporting this: And you know who Crowder is, right? So, you know, if I were on the same side as these people, who want to torture children to death, I’d really, deeply rethink how I got there. But that’s just me. You’re free to hate support who you want, of course. But every queer person hurt? Blood on your hands. Your rhetoric normalizes this hate. Emboldens the attackers. Those “white knights” who want to keep the innocent white women safe. Always the same. How you can live with that, I can’t imagine.", "target": "None"}, "86": {"text": "nce they’re done with “men in dresses”, they will come for “women in pants” Transphobic women are working towards their own demise", "target": "None"}, "87": {"text": "centedluminarysoul: monapill: scentedluminarysoul: monapill: scentedluminarysoul: monapill: scentedluminarysoul: I know that agender is part of the nonbinary umbrella, because nonbinary is anything not within the binary of female and male. But idk, nonbinary doesn’t really feel right to me. I somehow don’t like calling myself that. And idk why. Nonbinary is awesome. But it feels like it’s “in-between” the binary, whereas I, as an agender person, am complete outside and detached from the binary. Maybe it’s because of the media and the very specific nonbinary look that is often portrayed, that just isn’t me. Probably that, yeah. And it’s not that I hate that look or people looking like that or anything. I just don’t find myself in that. Same with trans, actually. I know it all belongs under the same umbrella, but again, I don’t view myself as trans. I’m just me. I don’t have a gender. I don’t understand gender. I don’t know what it’s good for. I just want to be perceived as a person. Hm. why do people write such long think pieces about not knowing their gender instead of realizing woman/man aren’t genders or personality types and you don’t need to do 10 years of soul searching to determine if they fit you Oh hey @monapill ! I’ve missed you! You promised me sources! And you haven’t answered my question: To you, and @terfclairenovak , I’d like to say: Long ago, right here on planet Earth, cis men (those with a peen that also see themselves as men) decided, they are the ruling class. They looked at people and categorized them based on superficial traits, such as having a cooch or a peen, and decided those without peen are weak and should serve them. They should only be good for reproduction. They even cut off bits of their bobs, so they wouldn’t and couldn’t enjoy something that should be enjoyable. Only work, no play, no humans rights. For centuries those without a peen, and other groups deemed lesser because of their superficial traits not favored by cis men (for example intersex/trans/nonbinary folk), have fought against being only seen and valued for their bodies, instead of their brains. Nowadays, science has shown that gender and body don’t always fit together. That those are indeed two different things. The brain develops independently from the body, at different times, and sometimes it develops differently, there is an incongruence. But now, people like you want to categorize people based solely on their bits again. Make laws surrounding those bits and their havers. Check those bits if the havers doesn’t fit your definition of what a bitshaver should look like. Even small children. You also want to only allow certain people into certain spaces after they had (parts of) their bits cut off. What does that make people like you? Are YOU really the victims here? Or are you playing another role? to answer your question: key word here is can. not that they do, but that they have the ability to bc their reproductive development is conducive to pregnancy/egg production. you’re right, males oppress women. unfortunately, oppression isn’t something you can identify in/out of. a male mutilating his genitalia to pass as a woman is not oppressed, the fact that misogyny is something he’s opted into is proof it’s not actual oppression. also, sex is real. it’s a material trait with consequences. there are certain things that should be segregated by sex, like sports or abuse shelters or jail, where there are possibly vulnerable populations or the body is being used. we want sex segregated spaces for safety and efficacy and comfort. it’s not “categorizing” people, the categories already exist. also, stop saying “bits,” it’s sex. we care about sex, the biological trait. your reproductive role. You literally just repeated everything without making an actual point or clarification, but with loads of hateful language. Obesession with genitals again. It’s only ever genitals and reproduction with you. Isn’t that exhausting? Can’t you see people for other things? Art? Music? Anything but SEX?? Hey. Hey mona. Why should SIX YEAR OLD CHILDREN need segregated bathrooms? Also, you literally just said the thing: The thing others are right now trying to tell me you never say. Congrats! the clarification is that being of the sex that can produce eggs does not mean you will; ie a woman who’s had a hysterectomy is female because the uterus is a female sex organ. you brought up genitalia first. yes, i see people as people, female people are people and male people are people, sex and personhood are not mutually exclusive. i’m not going to pretend sex isn’t relevant when we live in a sexist society similarly to how im not going to pretend race isn’t relevant when we live in a racist society. as a black woman, my sex and race are the reason i’m oppressed; pretending these traits don’t exist only allows oppression to continue. six year olds should have segregated bathrooms because adults have segregated bathrooms, and children aren’t as innocent as you’d think. i know countless friends who were assaulted by male classmates when they were very young. also, humans are not boats. a boat and a cart can both be made out of wood, but once you’ve developed as female or male you no longer have the structures that for the opposite sex’s reproductive organs/system. female and male are distinct sexes in humans, you can’t just “reorganize” our body parts so we’re interchangeable the clarification is that being of the sex that can produce eggs does not mean you will; ie a woman who’s had a hysterectomy is female because the uterus is a female sex organ. Excludes women without gametes. Excludes women born without uterus. Nice one. Tell me. Do sexists ask you nicely what is in your pants before opressing you? Do misogynists ask for your birth certificate before being misogynistic? Or do they do that based solely on THEIR perception of you? six year olds should have segregated bathrooms because adults have segregated bathrooms, Adults also have alcohol and tobacco. Adults also have driver licenses and cars. Dumb. And literally teaching children they’re different based on their genitals, and belong to different categories that should never mix. THAT is upholding gender roles. YOU are doing that. Do you… do I need to ask about segregated bathrooms in other contexts or… and children aren’t as innocent as you’d think. i know countless friends who were assaulted by male classmates when they were very young. Did they need to identify as girls first or did they just do it as boys? And your solution is… to check every girls genitals before she is allowed into the bathroom? Or what? Patriarchy sucks. It teaches boys from a young age that they are superior to girls, that they hold power over them and are allowed to. That they have right to their bodies. That’s wrong. And literally what we’re fighting. We want agency over our own bodies, and every child, every adult to live in peace, and comfortable in their bodies. I could look up the statistics on how trans people, especially girls and women, are much more likely to be assaulted the to be the assailant. But I know it’s useless, you wouldn’t read it, because you don’t care. You have your set belief and no amount of evidence to the contrary will ever change them. So I won’t bother with sources anymore (oh hey! Sources! The thing YOU promised ME. How we looking? Are you still gonna show them or) also, humans are not boats. Good job! Now go and explain to @terfclairenovak that humans are also not plants! for the opposite sex’s reproductive organs/system. And? So what? If you don’t reduce a woman to her reproductive organs, why should that matter? How is that useful in day to day life? Do you ask every woman you meet in a public restroom whether she was born with the capability of developing female reproductive organs? To determine whether she’s allowed in? Or are you maybe judging based on presentation? How’s that working out for you? Two women sexually assaulted trans woman in North Carolina bathroom, police say This Woman Was Allegedly Harassed in a Restroom Because Someone Thought She Was Transgender Though there are no reported incidents of transgender people attacking others in public bathrooms, the incidents of transgender people being attacked while trying to use the restroom are well documented.", "target": "None"}, "88": {"text": "onapill: gayfencingtongueegg: Terfs: When we allow trans women into women’s locker rooms, RAPE!!!! Meaningwhile my exercise group: Completely mixed, men, women, agender, change in the same room, in front of each other, because we’re all to lazy to go to the changing rooms in the next building congrats on your female friends never being assaulted before! do you want a cookie? believe it or not, women not feeling comfortable undressing around males is not us being overdramatic, plenty of us have trauma and would not like to be raped. Most of my female friends have been assaulted. Some viciously, for years. By cis men. By cis men in their family, their husbands, priests, teachers, supposed friends. Not a single one said “I identify as a woman” before doing it. They don’t make the assault their whole personality, though.", "target": "None"}, "89": {"text": "oubleca5t: something I find kinda interesting about radfems is that because they believe that womanhood is characterized by universal experiences of trauma and oppression, and because they believe that only they and people who agree with them correctly understand the nature of this oppression, they end up sounding like they believe that the only reason women would like things that they think are bad is if they’re somehow being tricked into liking it does a woman like wearing makeup or revealing clothes? patriarchal brainwashing. a cis woman who identifies as a lesbian dating a trans woman with a penis? she’s doing it out of guilt or pity, or she was pressured into it. afab people coming out as non-binary or trans men? that’s just internalized misogyny making them want to escape womanhood. hijabi women keeping their heads covered and dressing modestly? obviously they’ve been pressured into it by their oppressive islamic upbringing. women who are into kink, particularly if they’re submissive? abuse victims who don’t realize their male partners are taking advantage of them women aren’t allowed to like things under radical feminism. every aspect of a woman’s life is either a political statement or a decision made under duress. women have free will and agency unless they disagree with me, in which case they’re helpless victims who can’t recognize how oppressed they truly are. don’t get me wrong, I think it’s worth examining why you enjoy doing the things you’re doing. the modern state of corporatized pop-feminism has found a way to frame nearly every act, regardless of how harmful to one’s self or others, as feminist, and that’s a trap that you certainly don’t want to fall into. but the vision of womanhood that radfems paint is so bleak and joyless that it can never adequately act as an answer to that problem women aren’t allowed to like things under radical feminism", "target": "None"}, "90": {"text": "unkclowngod: Every Important Post I Found About Mental Illnesses & Disabilities: Redefining NPD words Co-morbidities in disorders Weaponizing empathy About “NPD abuse” About the word “sociopath” Disability pride month PSA Disabilities and “faking” Important PSA about stigmatizing paranoia and psychosis Support people with Cluster B PDs Not having empathy/compassion is not a bad thing “Narcissist abuse” and emotional abuse Ways to distract yourself from a hallucination Don’t encourage the delusion Narcissists and healthy relationships Casual ableism in posts Stop using mental illnesses as adjectives Things to say instead of “narcissist” Respect disabled and mentally ill people Define schizophrenia Fighting for schizophrenia Fun fact about NPD! Doctors are ableist too Hypersexuality is a trauma response Ppl with mental illnesses and neurodivergencies always know better than professionals Why we don’t equate “narcissistic” with “abusive” NPD symptoms Leave mentally ill people alone About trauma Disabled people deserve wheelchairs Therapists can be shit For psychotics who need to be sure people aren’t in their houses", "target": "None"}, "91": {"text": "rchicsaraleo: ‘no white person can decide what’s racism and what isn’t’“ till its black people calling out other people of color on their antiblackness like do you fuckers hear yourselves you cannot decide that our flag means death isn’t antiblack if you’re not black specially cause you enjoyed the gay ship like that is not fucking connected to making it happen without judging the characters a bit more for being actual live historical fucking trash, they were slavers ffs, stede and his wife were plantation owners, edward fucking teach blackbeard enslaved black people like get some fucking brains this is not the hill you wanna die on and respect black people’s fucking correct opinions based on idk? historic fact? yes pirate crews had people of color more often than not black people they still had no issue turning the racist switch on for them for virtue of existin like respect back people’s opinions and fucking listen forreal on sth that affects them personally like i get it \"just for fun” flies in your shitty head when you don’t have to think of black people as people like wtf dude it’s historic fact vs whitewashed fiction it has to be said like???????? also come on taika has a history of antiblackness even wwdits does very shitty things with black characters when they appear and more often than not he commits to stereotypes then there’s the whole mess with reservation dogs????? it’s an issue, it’s a trend and he’s not alone", "target": "POC"}, "92": {"text": "hirkers2018dirsanditan: “reproductive justice” focusing its tenets on children and not on women, and the infamous “right to have a child,” has led us to the liberal pro-surrogacy pro-child separation hellscape we are in, in part. it’s not about children. reproductive rights are about bodily autonomy, and bodily autonomy is about freedom from coercion, control, and commodification of the body. reproductive rights are also about familial rights, the right to raise your own family, the right to see your children, the right to communicate with them, etc. when you make it about the “right to have children” you fundamentally reject bodily autonomy and familial rights. you cannot have the right to a child if everyone has the right to be free from bodily coercion, control, and commodification, nor if everyone has the right to raise their own family and keep their family intact, to be in contact with their family, for parents and for children. for “everyone” to have a right to a child, women (and all female people) and children by default must lose their humanity and their autonomy. it’s not that “rights” aren’t ever complicated or compromised, or that rights-based personhood is the ideal model, but there is no justice in a “right to have a child.”", "target": "None"}, "93": {"text": "utchdot: Women can double jump", "target": "None"}, "94": {"text": "he-haunted-uterus: a-womb-of-ones-own: A woman who feels unsafe around men after being violently abused and assaulted by them is not “weaponizing trauma” you fucking goddamn psychopaths Men will say women’s ability to recognize patterns of abuse is misandry.", "target": "DISABLED"}, "95": {"text": "ichina-lycanthrope: “historical transmascs” = women who wanted to fight for their country, women who didn’t want to be married (to men), women who didn’t want to have children, women who didn’t want to wear restrictive clothing, women who didn’t want to be stay-at-home mothers, women who wanted to work, women who wanted to own property, women who wanted to run businesses, women who pretended to be men or presented as men to have the same rights as men or keep themselves safe from homophobic violence “lack of historical transfems” = “all the documented cases of this we could find were serial killers, clear fetishists, children who were coerced or forced into pedophilic relationships with wealthy men, and homosexual men who admitted to being men, so we sweep all of those under the rug they don’t exist, don’t talk about them, terf (also marsha was DEFINITELY a transwoman and he didn’t know it because he was too stupid to know himself better than us living in a time period without that information/level of acceptance, also he threw the first brick at stonewall even though he said he wasn’t there and most records say storme delarverie was the one to throw the first punch)”", "target": "None"}, "96": {"text": "etthediscourserageon: mucholowka: a-terf: The only reason less women commit suicide is because we use less violent and less messy ways to kill ourselves. The only reason I didn’t try to slit my wrist as a teenager was because I didnt want to make anyone clean up the blood. So I tried taking pills instead so it would make the least amount of mess. I had a friend of mine tell me she was going to shoot herself until she saw a movie where the blood was splattered all over the wall and she sobbed telling me how she didnt want to make her mom scrub it off the wall. Even when we want to end our own lives we still think about who we’re going to inconvenience. Female socialization follows us to our graves. Thank you for putting this into words!!! I get so frustrated when men try to use this as proof that they “aren’t privileged” (e.g., “if we’re so privileged why do we have higher suicide rates than women?”). Women try to kill themselves more often than men do, though statistics for this are not as well kept as death statistics. But men are more likely to use violent means. By the way, women are also more likely to have depression, anxiety, PTSD, and more. (The second link there goes into some of the reasons, but one can find more info if they look up “minority stress.”) Yet we are still less likely to die by suicide. One of the times men are at highest risk is after a divorce, or the death of their spouse. Because the entirety of their social support needs are placed on their spouse. This is why older men are at a high risk especially if they’re widowers, but the risk of older women (who statistically are likely to outlive men), who tend to have more social support, doesn’t increase. But men are afraid of providing or asking for social support with friends because it’s “for women”/”weak” or “gay.” Also, “it’s more acceptable for women to get help” is not “female privilege.” It’s more acceptable for women to get help because we are already perceived as weak; men fear seeking help because they fear being seen as weak. Patriarchy backfiring on men is not female privilege. (On a related note, “Men might be at the top of the hierarchy but they’re also at the bottom!! Why else do you think it’s okay for men to die in war but not women?” is bullshit as a counter to feminism for the same reason. Women aren’t drafted and were previously unable to serve in combat because we are considered too weak. Patriarchy backfiring on men is not female privilege.)", "target": "None"}, "97": {"text": "agnetictapedatastorage: The term ‘working woman’ [is] a tautology. There is no such thing as a woman who doesn’t work. There is only a woman who isn’t paid for her work. -Invisible Women", "target": "None"}, "98": {"text": "akimushiga-ru: women are really hanging around with men voluntarily. it shocks and disgusts me", "target": "WOMEN"}, "99": {"text": "retterf: venusandeartharegfs: shed1nja: puttingherinhistory: residentgoodgirl: fucknofetishization: gluten-free-pussy: Some MOC are strange because they view sex with white women as somehow “getting back” at white men/white supremacy. It’s weird how a lot men view sex not as an intimate act but as a tool of power and humiliation It’s true and you should say more “Women are framed as property, as collateral damage in the war between black men and white men, each trying to assert their masculinity. Men of both races speak of women in terms of ownership. White men talk of protecting “our women” and how “their women” have no virtue. Black men use similar language; they talk about how white men have defiled “our women”, and in return, they are going to lay waste to “their women”. This language perpetuates the universal subordinate status of women; black men acknowledge that white men own their women and white men acknowledge that black men own their women as well. Women are robbed of their personhood and simply become tools to be paternalistically protected from harm and vandalized for revenge.” — Routledge International Handbook of Race, Class, and Gender (2014).Shirley A. Jackson. source Quote from Eldridge Cleaver, Black Panther Party leader “It is for Black men to speak up and tell us why and how their manhood is so threatened that Black women should be the prime targets of their justifiable rage. What correct analysis of this capitalist dragon within which we live can legitimize the rape of Black women by Black men? At least Black feminists and other Black women have begun this much-needed dialogue, however bitter our words. At least we are not mowing down our brothers in the street, or bludgeoning them to death with hammers. [Robert] Staples pleads his cause by saying capitalism has left the Black man with only his penis for fulfillment, and a ‘curious rage.’ Is this rage any more legitimate than the rage of Black women? And why are Black women supposed to absorb that male rage in silence?” - Audre Lorde i think i’m going to be sick. that eldridge cleaver man actually raped women as “revenge” to white men. and he said he did it because white men have been violating Black women, but HE RAPED BLACK WOMEN TOO, AS “PRACTICE”, KNOWING FEW PEOPLE WOULD CARE. he didn’t do it to avenge the Black women hurt at the hands of white men, he did it because he sees women as property and he was angry that white men “soiled” Black men’s property, and as revenge, he would do the same to white men’s property. men don’t see us as our own people, but only as an extension of them. Men who rape their own race / ethnicity believe women are just something that they are entitled to. Those women are “their women” after all. They believe that men of other races / ethnicities need to respect that. When they don’t, they feel like the unspoken patriarchal contract between them has been broken and betrayed and must be met with some type of revenge for “soiling their women”; a resource is now “tainted”.", "target": "POC"}, "100": {"text": "tara-radfem: monapill: gayfencingtongueegg: as a black woman, i don’t think males being feminine is on par with blackface. what i consider comparable to blackface is them taking estrogen & declaring themselves women. there’s no difference. women are female, black people are people with dark skin and african ancestry. a male calling himself a woman is just as offensive as a white person calling themselves black. a male saying he’s a woman bc he has feminine interests is like a white person saying they’re black because they like rap and fried chicken— utterly offensive & distasteful. id even argue that since sex is immutable and clearly defined, whereas skin tone (though not ancestry/ethnic background) can vary during one’s life, it’s even more offensive for a male to call himself a woman than a white person to call themselves black. no, males in dresses is not blackface , but males wearing dresses and declaring themselves women is absolutely just as bad. But I must say, some drag performances do feel very misogynistic Some drag performances deliberately mock women and stereotypes of women, because we are the butt of the joke. Men dress in exaggerated caricatures of femininity to mock the same demographic group (women) oppressed by femininity. It’s oppressors treating the group they oppress like a costume in order to mock that group. I don’t believe it’s just as bad as blackface but it’s close", "target": "LGBT+"}, "101": {"text": "ltra-radfem: terventhotcrime: after peaking trans, don’t immediately go calling yourself a “radfem” because you’re gender critical at most. radical feminism is so much more than just trans discourse. this. radical feminism is critical of gender, sure, but it is also: also female only spaces, female separatism, rejecting femininity. it is anti prostitution and pornography, anti surrogacy, anti capitalism, it is critical of marriage, the nuclear family, and child rearing, it is critical of patriarchal religion. it is centering female people in your politics, your activism, and your life.", "target": "LGBT+"}, "102": {"text": "oonslady: The summary of male-dominated transactivism is that men have brainwashed liberal women and kind, good women who don’t want to be called bigots into allowing and encouraging abuse and violence against females just so that trans-identified men can get their way. It is literally the definition of a patriarchal movement. Fuck a woman’s safety, protection and feelings if a man wants to invade women’s spaces where they’re vulnerable like prisons, shelters and changing rooms, if a man wants to win at women’s sports because he’s losing in men’s sports, if a man wants to fuck lesbians, if a man wants women to be subservient to him out of fear of being called a bigot and harassed. It’s nothing new. Any woman who’s had to deal with an abusive male in her private life can recognize this in an instant.", "target": "LGBT+"}, "103": {"text": "-hate-men-and-there-are-reasons: womenarehuman: grannyweatherwaxx: denizen-mars: thevaginamonoblogs: one-road-to-asa-bay: astronofeminist: tilthat: TIL that Nazis ran brothels within concentration camps to motivate prisoners to work more. Over 35k women were forced into forced sex labour. via reddit.com “empowering” The fact that it took women’s research to bring this to light in the MID 1990s is disgusting. I remember wondering vaguely when I was younger why we never learned about sexual violence occurring in the camps. perhaps, I reasoned hopefully, the nazis were too busy being cruel and genocidal in other ways to want to sexually assault starving and disease-ridden women and girls? But of course not, as documented here and in other articles I’ve read somewhat recently. The Nazi’s misogyny and abuse against women and lesbians in particular only came to light due to female historians. Never trust men to tell the truth in history. Exhibit 636", "target": "None"}, "104": {"text": "odenor: imagine men going to idk 4chan and making threads like actually women are great. you all need to stop being mean to women. women are so cute and smart and brilliant. like bro have you ever seen a woman? the way they get so excited when you genuinely show interest in what she’s saying? imagine thinking women aren’t great wtf. and then every comment is like fuck yes!!! women are so great!!! if you hate women you’re an asshole!!! like that shit would never happen yet women will not stop making those same posts about men on tungle dot com", "target": "None"}, "105": {"text": "usansontag: when people talk of female socialisation they’re not saying there is one universal female experience that all women have that is exactly the same… they’re saying that in every society women are socialised into a role that is intended to ensure our subjugation and keep us subservient to men. and all women share in this experience, despite its infinite variations cross-culturally: we are intended to be second-class citizens and that’s easier to maintain if we are socialised as such.", "target": "None"}, "106": {"text": "s-gay-frogs: badmiffy: sobbing rn bc the russian soldiers are raping Ukrainian women. we knew this would happen too we all said it and we knew we were helpless and it’s happening constantly and I’m sick and angry. it happens with every war and conflict men just jump at any chance to rape women. they are despicable evil reprehensible. men only think about rape it’s all they know, on all sides men have “joked” about raping Ukrainian women, looked for porn depicting it, tried to create opportunities to rape Ukrainian women. joining the war effort just to rape. pretending to open their homes just to rape. a few days ago a Ukrainian woman was repeatedly raped by Russian soldiers, they tortured her and then open fired on her leaving her body unrecognisable. i cant take it anymore. women suffer so much more than men in war and no one can change my mind in war, men die with bullets and honour. fully clothed and recognised as valiant soldiers or civilians. in war, women often die after being sexually violated. naked, corpses burnt, gang raped in public, in front of family, friends, a spouse. breasts carved out, every crevice of her body violated. women are not even given dignity in death.", "target": "other"}, "107": {"text": "adicallyaligned: crime should be legal for women. I trust we would use it right", "target": "None"}, "108": {"text": "healkalinespinster: Men are like: “Women have it so easy! They can get all the sex they don’t want!”", "target": "None"}, "109": {"text": "oidofsky: ididntgiveyoupermissiontodothat: pinkcheesegreenghost: malasuerte00: angrychocolatefiend: sourcedumal: dynastylnoire: shabbosfemme: freedominwickedness: hyenaboy: “Yes, being in a female dominated field, I do know what it means to be marginalized. “ oh my god omg oh my fucking god The really ugly part is they’ve actually done multiple sociological studies on this, and guess what the result is? Men in female-dominated fields aren’t marginalized at all; they get special treatment and are fast-tracked to the top, getting more credit for their work, faster promotions, and greater pay and benefits than their female colleagues. Here’s one study. Here’s another. And another. ^phenomenon known as the glass escalator have you ever been around male nurses….mannnn Men in female dominated fields are entitled as hell. Don’t get it twisted teaching is a female-dominated field but most principals are male librarianship is a female-dominated field but most directors are male Cooking is female dominated but most chefs are males a large percent of hair stylists are women, but most major hair care brands are owned by men and Paul Mitchell’s products are full of toxins anyway! Glass Escalator in action", "target": "None"}, "110": {"text": "EWS GET OUT OF EUROPE YOU DONT BELONG HERE", "target": "JEWS"}, "111": {"text": "oadbreachm: This is the level of retardation that among us fans are capable of.", "target": "DISABLED"}, "112": {"text": "9-boiled-cabbages: i suffer from severe retardism", "target": "DISABLED"}, "113": {"text": "y discord friends are retards... im bored so if you want to friend u on discord if u have it then ask me or tell me secretly on dms so i can gladly friend u", "target": "DISABLED"}, "114": {"text": "sthete-god: Some of my relatives are truly retarded", "target": "DISABLED"}, "115": {"text": "k FAGGOTBlocked for being a cuck", "target": "LGBT+"}, "116": {"text": "t school there's this huge crater-like hole that we called the retard pit because during winter the surface around it turned to ice then add some kids to the equation and now you know why we called it the retard pit the pic above was when there was lighter traffic so you don't know the part where me and my friends had to go in the pit to get a soccer ball and we couldn't get out then some retard threw a basketball in", "target": "DISABLED"}, "117": {"text": "eetmlm: Black boys aren’t scary. Black masculinity isn’t scary. Black boys and black masculine people deserve better.", "target": "None"}, "118": {"text": "ay", "target": "LGBT+"}, "119": {"text": "ing-monky: yeah i understand women. they all want daggers and swords. it’s quite simple really", "target": "None"}, "120": {"text": "ircularcracks: I love insane women. And I don’t mean that in the way men say it like ‘haha emotionally unstable and hot women are so sexy’ because I actually want to murder those men with an axe. I just love women who are unhinged and a little bit criminal, if not convicted of multiple crimes. Love and support them. Women should murder more often.", "target": "None"}, "121": {"text": "he Fag Wish Heaven is waking up to this and then having them spit on you, call you slurs and use, abuse and humiliate you beyond repair", "target": "LGBT+"}, "122": {"text": "egressive-leftists-are-cancer: Social Justice activists have expanded the LGBT Community acronyms to be more inclusive and strive for equality… But is this going too far? Ghastly ghost-splains to us his improvements to the LGBT acronym. Discussing Gay, Lesbian, and Transgender issues. Gavin McInnes says gays are good people, but this image is undermined by a tiny minority of annoying homosexual activists. I identify as an Androphile, not Gay. And precisely because, I don’t wish to be associated with LGBT++ ideology.", "target": "LGBT+"}, "123": {"text": "elodicprism: Happy National Coming Out Day, Cuties! Gay pride is not rainbow flags and parades. Gay pride is you, unafraid.", "target": "None"}, "124": {"text": "y new artwork. Hitler did nothing wrong, kill Jews.", "target": "JEWS"}, "125": {"text": "ITLER IS MY PREACHJER/FETISH jkjdksdjksjsk AND I HATE NIGGERS", "target": "POC"}, "126": {"text": "EIL EUROPA WHITE POWER", "target": "POC"}, "127": {"text": "e Europa need to close the borders to stop the 3rd world camel fuckers from flooding our country's borders", "target": "MIGRANTS"}, "128": {"text": "UDDHISM IS EVOLVING Buddhism started in the forests at the base of the himalayas in Northern India 2500 years ago. Then it was a wide open evangelical movement which is to say that it spread through proselytization. In fact most of the suttas, the discourses (teachings) of the Buddha are just that exhortations to various groups that his dhamma is the true teaching. Later it became part of the fabric of many East Asian communities where it ceased to be evangelical and instead turned inward, became cloistered and apart from the people. Buddhist monasteries offered places for sons to study and for common people to receive merit (puñña in Pali) by donating to their support. The monks served much the same role as the clergy in medieval Europe. Today it has morphed yet again. Jumped the shore of the Pacific Ocean and now, stripped of 2400 years of cultural accumulation it speaks to us. Hidden in the suttas in plain sight is a message. It says this. There is a way out of the suffering which is our lot as mortal beings subject to loss, aging, sickness and death. Then, and this is the HIDDEN PART he lays the TECHNIQUE out for us. It is difficult to decipher this part of message though because so many books have been written which cloud the simple set of practices. They deal with the way we THINK and PROCESS SENSORY INPUT. All the rest of this Buddhism stuff is window dressing. Hey I love it. I have an altar and some lovely Buddhist art. I love the CULTURE of Buddhism. It is just irrelevant to the process. Shanti, friends. Sam.", "target": "None"}, "129": {"text": "ingdongyouarewrong: also as a side note, saying ‘sounds terfy’ every time someone says the word misogyny or patriarchy is literally just ceding ground to terfs for no reason. the only people who benefit from the idea that just… talking about feminism in any capacity makes you a terf are 1) the kind of men who materially benefit from women not talking about feminism, and 2) terfs, who would LOVE it if people believed there was no way to talk about feminism without being a bigot", "target": "None"}, "130": {"text": "oe-is-a-mess: bettiesbullshit: feministism: knight-of-vengeance: feministism: someoneintheshadow456: feministism: feministism: i am living for this trend of women calling men lawnmowers and wallets lmao. y’all objectify women FOR YEARS, EVERY DAY and get offended when it’s done to you for A WEEK APPARENTLY GUYS HAVE STARTED A #REPEALTHE19TH “MOVEMENT” AND THIS IS PART OF WHY AHAHAHAGAGAYAH IM DEAD YALL ARE SO WEAK anyways keep it up ladies expose their fragile asses “Lawnmowers and wallets” You mean the fact that men are rightfully calling out thinly veiled classism (”men are either peons to do the jobs we don’t want or free ATM machines”), and the fact that these women think it’s socially acceptable to be classist because they’re women? Newsflash - this is the kind of “misandry” I’ve heard growing up, and it was ALWAYS, without fail, directed at working class and/or lower caste men. Y’all ain’t slick. Just say you want to find a socially acceptable excuse to hate poor men and LEAVE. you —————————————————the point @yaspookybitch got it: “that’s the whole point though. Misogynists already think women do those things even when they don’t.” women have just started objectifying men in this way, like men have been doing since forever, in attempts to explain how this can feel and why it’s frustrating. guys tell women to “get in the kitchen” and “keep your mouth shut” and say “it’s just a joke”, but don’t like it when the tables turn. women start doing to men what men have been doing to women since the dawn of time, and men decide women don’t deserve rights anymore. see why that’s ironic? for me, it’s a means of protest. dishing out what they give is a way of mirroring their actions and forcing them to reflect. (granted, a lot of them will never understand the hypocrisy, which almost makes it more amusing and emphasizing.) Are you on crack? Animals objectify other animals for sex and we’re barely more than shaved chimpanzees. Women consume porn, women can be sexually aggressive, for fuck’s sake, female staff are the primary rapists in juvenile detention centers for boys. Having two X chromosomes does not turn you into a goshdamned Barbie doll with no junk or libido. Men objectify women. Women objectify women. Women objectify men. Men objectify men. And they’ve been doing it since they got the boot from Eden. I shouldn’t have to explain this to you, but you’re denser than uranium and about as reactive as lead. There are few things that have pissed me off as much as this dumbass thread. Fucking damnit, May feels like a year already and it’s only 12:23. I shouldn’t have to explain this to you, but people are allowed to objectify themselves. Men are allowed to objectify themselves. Women are allowed to objectify themselves. It becomes wrong when that’s being done to the opposite sex so consistently. There’s a difference between someone doing it on their own, versus having it done to them nonconsenually. Men have objectified women since the dawn of time. I’m not saying women never objectify men, but only recently has it started being done on a very public, very open, very wide-scale. Not sure what you’re not getting. People are allowed to objectify themselves, but shouldn’t be doing it to others unless they have said it’s okay. Women beginning to actively do it to men and dismissing it as a joke, like they do, is spinning it on its head and putting them in our shoes, to help them understand why it can be frustrating. This is something women have experienced on a daily basis for centuries. I don’t mean to sound like I’m encouraging any type of sexism, but what we’ve been doing up until this point has changed absolutely nothing, so this is a nice change of pace. if you can’t see how recently calling men lawnmowers and wallets is payback for men calling us dishwashers and housewives our entire lives, you never cared about objectifcation or being equal in the first place. Also, can we talk about how men doing those things (working/taking care of the lawn/etc) are a product of misogyny? It has changed a bit now, but for the longest time women weren’t allowed to work so they depended financially on men, now that we’ve decided to do exactly that (we really don’t that’s the whole point), they have a problem with it. They are only okay with it if it means they can control women but the moment we step up and “accept” and reclaim the situation, they suddenly realize they are not in control anymore and call it “misandry”. Men were the “strong ones”, as opposed to women who were the “weak and delicate ones”, so they took care of the lawn and fixed stuff around the house because “women belonged in the kitchen”. Now they are angry that we tell them they “belong” doing what they were CHOOSING to do all along. The difference between women calling men “lawnmowers” and “wallets” and men saying women “belong in the kitchen” and “should always be polite and keep their mouth shut” is (besides the fact that it is a fucking joke to make misogynist men angry) that men were never oppressed by women into doing those things in the first place, and they never had to fight to not do those things and be able to express themselves, and work, and vote and be in an environment they chose to be in, because for men, THAT WAS ALWAYS A CHOICE. If you can’t understand this basic concept and think that women are misandrists for doing to you what you have done to women for ages AS A JOKE, then you are the one that is denser than uranium and about as reactive as lead. PERIOD", "target": "None"}, "131": {"text": "eep the money grubbing Jews out of Europa", "target": "JEWS"}, "132": {"text": "uslim women bring violence on themselves by continuing to be muslim", "target": "MUSLIMS"}, "133": {"text": "ll MUSLIMS ARE TERRORIST KEEP THEM OUT OF EUROPE", "target": "MUSLIMS"}, "134": {"text": "ne Million Illegals - a large portion of which will be lining up for welfare benefits. 63% of them, as it were. But what does that really look like?", "target": "MIGRANTS"}, "135": {"text": " will not be forced to learn a foreign language to accomodate illegals in my country", "target": "MIGRANTS"}, "136": {"text": "iden wants to give Illegals 450k. Disgusting", "target": "MIGRANTS"}, "137": {"text": "ow we need to round up the 20-30 million illegals and \"expedite\" their return back across the border.", "target": "MIGRANTS"}, "138": {"text": "ophie, Countess of Wessex: Plight of Afghanistan’s women is worse than ever The Countess of Wessex has issued a plea for the world not to forget the women of Afghanistan, as she warns the “devastating invasion” of Ukraine has left them at the mercy of the Taliban. The Countess, speaking at the United Nations in New York, said life has already regressed for women and girls in Afghanistan, dismissing the Taliban’s claims that they were letting them continue their lives freely as “not true”. “It is so hard to imagine how much has changed for so many in so little time,” she told delegates. “Where once there was hope, with women playing a central role in society, there is now hunger, destitution and violence. \"And now our attention is at risk of being diverted from Afghanistan, with the devastating invasion of Ukraine by its Russian neighbour. \"But while our focus has naturally turned to these events, the crisis in Afghanistan has not gone away, and the effects are worsening daily.” The Countess spoke at the Upholding Women’s Rights In Afghanistan meeting in her long-term role with the Women, Peace and Security (WPS) agenda. She joined UN Women representatives and NGOs at a briefing, led by the UK Mission to New York, on the impact of the conflict in Ukraine on women and girls. Describing her recent conversation with an Afghan translator who left his homeland in 2014, the Countess said he had been “almost in tears” while speaking of his female relatives still there. “Most of them dare not even go out of their houses at all, terrified of being taken, abused, or worse,” she said, calling them “virtual prisoners in their own homes”. “Life has regressed, yet the Taliban would have us believe that they are allowing citizens to go about their normal activities,” she said. “We know that this is not true. \"So while we welcome their announcement that they have committed to re-opening schools to girls this month, and the return of some women to university, what we know is that the rights of women and girls have worsened.” She added: “Afghanistan is facing a desperate humanitarian and economic crisis.” The Countess is spending four days on a solo working trip to New York, where she appeared at the UN as well as taking part in engagements promoting gender equality in the workplace. To mark Commonwealth Day, she visited the Queen Elizabeth II Garden which celebrates the historic ties of friendship between the US, UK and Commonwealth, and attended a reception with leaders. source: https://www.telegraph.co.uk/royal-family/2022/03/15/sophie-countess-wessex-crisis-afghanistans-women-worse-ever/?utm_content=telegraph&utm_medium=Social&utm_campaign=Echobox&utm_source=Twitter#Echobox=1647378795-1", "target": "None"}, "139": {"text": "ommunismkills: “I hate Western civilization.”, writes the gender-queer blogger who posts about his drug usage, promiscuity, and homosexuality, not understanding he would certainly get stoned to death in any non-Westernized nation. I like how they claim “we protect gays from facist” while waving Soviet flags. Like Article 121 didn’t send gay men to labor camps, or that “wasn’t real communism”.", "target": "LGBT+"}, "140": {"text": "hecaitiff: millennial-review: Lone wolves hear dog whistles. You mean this one? Tumblr: Only white people can be racist. Tumblr: I’m anti racist Also tumblr: this Black person is racist against Blacks for saying she wouldn’t hire someone with a scrabble name. Asians are White because they have “white privilege”, and somebody left a racial slur on a receipt for a Asian Hooters waitress.", "target": "POC"}, "141": {"text": "uethegovernment: let women decide what they want to do with their own bodies challenge", "target": "None"}, "142": {"text": "EWS have funded every war since the 1200s. They are funding the one in Russia", "target": "JEWS"}, "143": {"text": "eep Illegals out of America", "target": "MIGRANTS"}, "144": {"text": "he Christian state of America needed to go into Afghan and stop the Muslims. All they do is kill Christians", "target": "MUSLIMS"}, "145": {"text": "ear illegals, If you knowingly come into our country illegally, I hate you. You do nothing but cause trouble, you don’t help America and you’re not helping your family. I don’t care about your excuses, you came here illegally. If you want to live a good and prosperous life in America, do it the right way. Do it legally. If you don’t want to get your family torn apart, maybe you should follow the law of the land. Illegal immigrants DO NOT have rights. Wanna know why? Because they’re ILLEGAL. Illegal immigrants cost the U.S. taxpayers BILLIONS of dollars every single year. They aren’t helping anyone except their selfish selves.", "target": "MIGRANTS"}, "146": {"text": "orry for acting like a retard, I just feel very vulnerable around you and I’m scared.", "target": "DISABLED"}, "147": {"text": "k retard, you dont deserve to exist", "target": "DISABLED"}, "148": {"text": "o more Illegals. Close the border.", "target": "MIGRANTS"}, "149": {"text": "umblr Members: On a scale of 1-10, how retarded are you? Tumblr Flagging System: Red", "target": "DISABLED"}, "150": {"text": "hat happened to the Jews in the Holocost was a blessing", "target": "JEWS"}, "151": {"text": " think God chose Jews to carry the Karmic burden of all of the species that man has caused to be extinct. What went extinct right before their previous holocost?", "target": "JEWS"}, "152": {"text": " can't stand hasidic Jews", "target": "JEWS"}, "153": {"text": "ews are a stain to society and need to be forced out for christianity", "target": "JEWS"}, "154": {"text": "emember to show your support by posting about it!! Let us see your support! Let us know you care and haven't forgotten us!! You can also do that by: donating to indigenous charities & causes shopping at indigenous businesses (our jewelery is gorgeous and it's ABSOLUTELY ok for you to wear if bought from Indigenous ppl) educating yourself about the Indigenous cultures around you donating to Indigenous people supporting the landback movement Don't forget our southern cousins either, they were the first of us to feel the affects of Columbus's many abuses Bring attention to the ongoing affects of colonization so that we have support when we make and demand better!", "target": "None"}, "155": {"text": "ou guys, Why is it so hard for people to be friends with people who have different opinions? I had a co worker who is opposite me in every way politically, but we still enjoyed working together and it was always a good time when our squad would get after work snacks. I currently have a friend who doesn’t like discussing politics but knows where I stand and I know she’s stands more left than I do, and that’s fine! We know we don’t agree, but we know the other wants the best for people at the end of the day. I understand people become blinded by their anger and sense of supposed justice, but it still blows my mind that there are so many people who can’t handle being around a (reasonable)person who has completely opposite opinions from them. It honestly feels like a Monty python sketch sometimes. It’s all a bit silly.", "target": "None"}, "156": {"text": "eople center-left complain like \"We didn't vote for this! We had no choice!\" Like y'all didn't spend a whole year of primaries flocking to the polls to vote for Biden against a diverse field of 20+ candidates. You certainly did choose this. Y'all had so many options to pick from but you really had your hearts set on the old power hungry racist with a history of directly fucking over the people for his own personal gain.", "target": "None"}, "157": {"text": "emember when everyone said they'd hold Biden accountable of everyone voted for him and then he won and we asked when they would start holding him accountable and they said \"can we have a second to celebrate please\" and since then there's been an insurrection, ongoing mishandling of the pandemic, still kids in cages, ongoing police brutality, school shootings, and it's been almost a year since he was elected. hahahahaha FUCK YOU", "target": "None"}, "158": {"text": " could sense most liberals didn't care about gay people and were only doing what they thought was the right thing to do without questioning it during the whole gay marriage debate era of the 00s because they always called homophobes \"bigots\". They couldn't name the problem. You can tell a lot of liberals thought that homophobes didn't like gay people because we were different rather than because we were gay. They never critically thought about homophobia, they were just riding the wave. Those same people today don't have any desire to think about trans issues. They just know it's the liberal thing to do so they're gonna ride the wave.", "target": "None"}, "159": {"text": "eminder that every credible biologist will tell you that biological sex is a spectrum too", "target": "None"}, "160": {"text": "ust to make things clear -and I mean this with the utmost charity- the government is not your friend, politicians do not care about you, and you cannot claim to be anti-establishment or anti mega-corps whilst maintaining that either of the two aforementioned are untrue", "target": "None"}}